[
  {
    "set_id": 1,
    "size": 2,
    "tools": [
      {
        "tool_id": "Lodestar MCP Server::download-svg-assets",
        "server_name": "Lodestar MCP Server",
        "tool_name": "download-svg-assets",
        "description": "Download specific SVG assets from a Figma file by providing node IDs and save them to a specified local directory for streamlined asset management in development workflows."
      },
      {
        "tool_id": "Lodestar MCP Server::extract-svg-assets",
        "server_name": "Lodestar MCP Server",
        "tool_name": "extract-svg-assets",
        "description": "Extract SVG assets from Figma files by analyzing the design structure and downloading resources using specified file keys and node IDs. Streamlines asset management for web development."
      }
    ]
  },
  {
    "set_id": 2,
    "size": 15,
    "tools": [
      {
        "tool_id": "Image Generation MCP Server::generate_image",
        "server_name": "Image Generation MCP Server",
        "tool_name": "generate_image",
        "description": "Create custom images using a text prompt with adjustable parameters like dimensions, model, and output format. Save images as PNG or generate multiple versions with the Together AI API."
      },
      {
        "tool_id": "AWS Nova Canvas::generate_image",
        "server_name": "AWS Nova Canvas",
        "tool_name": "generate_image",
        "description": "Create images from text prompts using AWS Nova Canvas. Save generated visuals to your workspace, ensuring precise customization with prompt details, dimensions, and quality settings."
      },
      {
        "tool_id": "Together AI Image Server::generate_image",
        "server_name": "Together AI Image Server",
        "tool_name": "generate_image",
        "description": "Create images from text prompts using AI, with options to customize the number of images and diffusion steps. Powered by Together AI Image Server for efficient visual content generation."
      },
      {
        "tool_id": "Table of Contents::generate_image",
        "server_name": "Table of Contents",
        "tool_name": "generate_image",
        "description": "Create high-quality raster or vector images from text prompts using customizable styles, dimensions, and models. Ideal for generating digital illustrations, icons, logos, and realistic images with pre..."
      },
      {
        "tool_id": "Amazon Bedrock MCP Server::generate_image",
        "server_name": "Amazon Bedrock MCP Server",
        "tool_name": "generate_image",
        "description": "Create AI-generated images using the Amazon Nova Canvas model. Input text prompts, adjust parameters like size and quality, and receive Base64-encoded images for diverse applications."
      },
      {
        "tool_id": "MCPollinations Multimodal MCP Server::generateImageUrl",
        "server_name": "MCPollinations Multimodal MCP Server",
        "tool_name": "generateImageUrl",
        "description": "Create an image URL from a text prompt using customizable height, width, model, and enhancement options for tailored visual outputs."
      },
      {
        "tool_id": "Gemini Image Generator MCP Server::generate_image_from_text",
        "server_name": "Gemini Image Generator MCP Server",
        "tool_name": "generate_image_from_text",
        "description": "Transform text prompts into high-quality images using Google's Gemini model. Ideal for creating visuals directly from descriptive inputs via the MCP protocol."
      },
      {
        "tool_id": "powerpoint MCP server::generate-and-save-image",
        "server_name": "powerpoint MCP server",
        "tool_name": "generate-and-save-image",
        "description": "Create and save custom images in PNG format using a descriptive prompt. Ideal for enhancing PowerPoint presentations with tailored visuals generated by a FLUX model."
      },
      {
        "tool_id": "LetzAI MCP Setup Guide::letzai_create_image",
        "server_name": "LetzAI MCP Setup Guide",
        "tool_name": "letzai_create_image",
        "description": "Generate custom images using AI by providing a text prompt. Adjust settings like creativity, quality, mode, and dimensions to create photorealistic or artistic visuals."
      },
      {
        "tool_id": "image-gen MCP Server::generate_image",
        "server_name": "image-gen MCP Server",
        "tool_name": "generate_image",
        "description": "Create custom images with Stable Diffusion by providing prompts, adjusting dimensions, and refining details via configurable parameters like batch size, CFG scale, and sampling steps."
      },
      {
        "tool_id": "Image Generator MCP Server::generate-image",
        "server_name": "Image Generator MCP Server",
        "tool_name": "generate-image",
        "description": "Create custom images using Replicate's Stable Diffusion model. Define dimensions, prompts, and settings to generate and save visuals directly to your local filesystem."
      },
      {
        "tool_id": "MCP Asset Generator::generateImage",
        "server_name": "MCP Asset Generator",
        "tool_name": "generateImage",
        "description": "Convert text prompts into high-quality images for game and web development projects by specifying output path, size, and quality using OpenAI’s image generation capabilities."
      },
      {
        "tool_id": "MCP Server Template for Cursor IDE::generate_image",
        "server_name": "MCP Server Template for Cursor IDE",
        "tool_name": "generate_image",
        "description": "Create custom images using DALL-E 3 by providing a text prompt. Adjust image quality, size, and quantity within the MCP Server Template for Cursor IDE."
      },
      {
        "tool_id": "4o-image MCP Server::generateImage",
        "server_name": "4o-image MCP Server",
        "tool_name": "generateImage",
        "description": "Create or edit images using text prompts or base images. Automatically opens results in your browser and provides direct links for easy access."
      },
      {
        "tool_id": "MCPollinations Multimodal MCP Server::generateImage",
        "server_name": "MCPollinations Multimodal MCP Server",
        "tool_name": "generateImage",
        "description": "Create images using AI by providing a text prompt, adjusting dimensions, format, and saving location. Enhance prompts with LLM, choose models, and ensure reproducibility with seed values."
      }
    ]
  },
  {
    "set_id": 3,
    "size": 11,
    "tools": [
      {
        "tool_id": "ReviewWebsite.com - MCP Server::convert_to_markdown",
        "server_name": "ReviewWebsite.com - MCP Server",
        "tool_name": "convert_to_markdown",
        "description": "Convert URLs to Markdown format using AI via the ReviewWebsite API. Input the URL, choose an AI model, and optionally set delays or enable debug mode for streamlined content transformation."
      },
      {
        "tool_id": "MCP Webscan Server::fetch-page",
        "server_name": "MCP Webscan Server",
        "tool_name": "fetch-page",
        "description": "Extract web page content and convert it to Markdown format for analysis or storage. Specify a URL and optional selector to fetch precise data efficiently with MCP Webscan Server."
      },
      {
        "tool_id": "ReviewWebsite.com - MCP Server::scrape_url",
        "server_name": "ReviewWebsite.com - MCP Server",
        "tool_name": "scrape_url",
        "description": "Scrape web content from any URL using ReviewWebsite API, enabling data extraction, URL-to-markdown conversion, and web content interaction for AI-powered tasks."
      },
      {
        "tool_id": "ScrapeGraph MCP Server::markdownify",
        "server_name": "ScrapeGraph MCP Server",
        "tool_name": "markdownify",
        "description": "Convert webpage content into clean, formatted markdown using a simple URL input. Ideal for transforming webpages into easy-to-read text format with ScrapeGraph MCP Server."
      },
      {
        "tool_id": "Fetcher MCP::fetch_url",
        "server_name": "Fetcher MCP",
        "tool_name": "fetch_url",
        "description": "Retrieve web page content via URL, extract main content, and convert it to Markdown or HTML. Customize options like media blocking, page timeout, and navigation settings for efficient content fetching..."
      },
      {
        "tool_id": "Fetch MCP Server::fetch",
        "server_name": "Fetch MCP Server",
        "tool_name": "fetch",
        "description": "Retrieve and process web content by fetching URLs, converting HTML to markdown, and optionally extracting specific character ranges for focused information retrieval."
      },
      {
        "tool_id": "pure.md MCP server::unblock-url",
        "server_name": "pure.md MCP server",
        "tool_name": "unblock-url",
        "description": "Access blocked web content by converting URLs into markdown format using the pure.md MCP server, enabling AI clients to retrieve and process information efficiently."
      },
      {
        "tool_id": "Markdownify MCP Server::webpage-to-markdown",
        "server_name": "Markdownify MCP Server",
        "tool_name": "webpage-to-markdown",
        "description": "Convert any webpage into Markdown format using the Markdownify MCP Server. Extract and transform web content for simplified reading, sharing, and further editing in Markdown."
      },
      {
        "tool_id": "Markdown Downloader MCP Server::download_markdown",
        "server_name": "Markdown Downloader MCP Server",
        "tool_name": "download_markdown",
        "description": "Convert webpages to markdown files with r.jina.ai by entering the URL. Optionally specify a subdirectory for organized storage in the Markdown Downloader MCP server."
      },
      {
        "tool_id": "mcp-server-fetch-python::get-markdown",
        "server_name": "mcp-server-fetch-python",
        "tool_name": "get-markdown",
        "description": "Extract web page content into structured Markdown format, preserving tables and lists. Ideal for converting HTML to clean, readable text while maintaining document structure."
      },
      {
        "tool_id": "MCP Access Template::get-webpage-markdown",
        "server_name": "MCP Access Template",
        "tool_name": "get-webpage-markdown",
        "description": "Convert web page content into Markdown format by parsing a provided URL, enabling easy text extraction and structured content processing."
      }
    ]
  },
  {
    "set_id": 4,
    "size": 3,
    "tools": [
      {
        "tool_id": "AIM Guard MCP::aim-text-guard",
        "server_name": "AIM Guard MCP",
        "tool_name": "aim-text-guard",
        "description": "Analyzes text to identify harmful content, ensuring AI agents adhere to security guidelines and interact safely with external services. Part of the AIM-Guard-MCP server."
      },
      {
        "tool_id": "Enkrypt AI MCP Server::add_guardrails_policy",
        "server_name": "Enkrypt AI MCP Server",
        "tool_name": "add_guardrails_policy",
        "description": "Define and enforce custom content moderation rules by adding a guardrails policy. Configure detectors for injection attacks, PII, NSFW content, toxicity, and more to ensure AI-generated outputs align ..."
      },
      {
        "tool_id": "Baidu Cloud AI Content Safety MCP Server::input_analyze",
        "server_name": "Baidu Cloud AI Content Safety MCP Server",
        "tool_name": "input_analyze",
        "description": "Detect and analyze text for safety risks using Baidu Cloud AI Content Safety MCP Server. Identify harmful or unsafe content to ensure secure communication and compliance."
      }
    ]
  },
  {
    "set_id": 5,
    "size": 5,
    "tools": [
      {
        "tool_id": "playwright-server MCP server::playwright_click",
        "server_name": "playwright-server MCP server",
        "tool_name": "playwright_click",
        "description": "Perform automated clicks on web page elements using CSS selectors with Playwright Server MCP, designed for precise interaction in web automation tasks."
      },
      {
        "tool_id": "Chrome Tools MCP Server::click_element",
        "server_name": "Chrome Tools MCP Server",
        "tool_name": "click_element",
        "description": "Use the 'click_element' tool to programmatically click web elements in Chrome tabs by specifying a CSS selector and tab ID, enabling precise browser automation via the Chrome DevTools Protocol."
      },
      {
        "tool_id": "MCP Web Browser Server::browser_click",
        "server_name": "MCP Web Browser Server",
        "tool_name": "browser_click",
        "description": "Automate clicking on web page elements using CSS selectors to simulate user interactions during security testing, aiding in vulnerability detection for web applications."
      },
      {
        "tool_id": "Puppeteer MCP Server::puppeteer_click",
        "server_name": "Puppeteer MCP Server",
        "tool_name": "puppeteer_click",
        "description": "Automate clicking on web page elements using a CSS selector via the Puppeteer MCP Server, enabling precise browser interaction and form submissions."
      },
      {
        "tool_id": "Visual UI Debug Agent MCP::playwright_click",
        "server_name": "Visual UI Debug Agent MCP",
        "tool_name": "playwright_click",
        "description": "Automate UI interactions by clicking specified elements using CSS selectors. Designed for AI-driven vision analysis and testing workflows with the AI Vision Debug MCP Server."
      }
    ]
  },
  {
    "set_id": 6,
    "size": 3,
    "tools": [
      {
        "tool_id": "Coinmarket MCP server::get_quotes",
        "server_name": "Coinmarket MCP server",
        "tool_name": "get_quotes",
        "description": "Fetch cryptocurrency quotes by providing a slug or symbol. Integrates with Coinmarket API to retrieve accurate pricing data for crypto assets."
      },
      {
        "tool_id": "Token Metrics MCP Server::get_tokens_price",
        "server_name": "Token Metrics MCP Server",
        "tool_name": "get_tokens_price",
        "description": "Retrieve real-time cryptocurrency prices using token IDs. Input a comma-separated list of token IDs to fetch accurate pricing data via the Token Metrics API. Ideal for accessing up-to-date market info..."
      },
      {
        "tool_id": "Coincap MCP::get_crypto_price",
        "server_name": "Coincap MCP",
        "tool_name": "get_crypto_price",
        "description": "Retrieve real-time cryptocurrency prices using CoinCap's public API. Input the crypto coin name to instantly fetch its current market value without needing API keys."
      }
    ]
  },
  {
    "set_id": 7,
    "size": 2,
    "tools": [
      {
        "tool_id": "X (Twitter) MCP server::get_user_by_screen_name",
        "server_name": "X (Twitter) MCP server",
        "tool_name": "get_user_by_screen_name",
        "description": "Retrieve user details from X (Twitter) using their screen name. Enter the screen name to access profile information efficiently."
      },
      {
        "tool_id": "X (Twitter) MCP server::get_user_profile",
        "server_name": "X (Twitter) MCP server",
        "tool_name": "get_user_profile",
        "description": "Retrieve comprehensive profile details for a specific user on X (Twitter) by providing their user ID. This tool simplifies access to user information for analysis or integration purposes."
      }
    ]
  },
  {
    "set_id": 8,
    "size": 2,
    "tools": [
      {
        "tool_id": "mcp-knowledge-graph::delete_observations",
        "server_name": "mcp-knowledge-graph",
        "tool_name": "delete_observations",
        "description": "Remove specific observations from entities in the mcp-knowledge-graph to maintain accurate and up-to-date entity data. Specify entity names and observation arrays for targeted deletions."
      },
      {
        "tool_id": "Knowledge Graph Memory Server::delete_observations",
        "server_name": "Knowledge Graph Memory Server",
        "tool_name": "delete_observations",
        "description": "Remove specific observations from entities stored in a knowledge graph to maintain accurate and up-to-date information across the memory system."
      }
    ]
  },
  {
    "set_id": 9,
    "size": 2,
    "tools": [
      {
        "tool_id": "BlenderMCP - Blender Model Context Protocol Integration::download_polyhaven_asset",
        "server_name": "BlenderMCP - Blender Model Context Protocol Integration",
        "tool_name": "download_polyhaven_asset",
        "description": "Download Polyhaven assets directly into Blender by specifying asset ID, type, resolution, and optional file format. Streamlines 3D workflow with asset integration."
      },
      {
        "tool_id": "Tripo MCP Server::download_polyhaven_asset",
        "server_name": "Tripo MCP Server",
        "tool_name": "download_polyhaven_asset",
        "description": "Download Polyhaven assets (HDRI, textures, models) for Blender. Specify asset ID, type, resolution, and format to import directly."
      }
    ]
  },
  {
    "set_id": 10,
    "size": 4,
    "tools": [
      {
        "tool_id": "Code Index MCP::search_code_advanced",
        "server_name": "Code Index MCP",
        "tool_name": "search_code_advanced",
        "description": "Perform advanced code searches with external tools like ripgrep, ag, or grep for enhanced performance. Supports case sensitivity, context lines, file patterns, and safe fuzzy matching for precise resu..."
      },
      {
        "tool_id": "MCP Ripgrep Server::advanced-search",
        "server_name": "MCP Ripgrep Server",
        "tool_name": "advanced-search",
        "description": "Perform high-performance text searches across files using the MCP Ripgrep Server. Filter by file type, show context lines, use regex or literal strings, and customize search options like case sensitiv..."
      },
      {
        "tool_id": "MCP Ripgrep Server::search",
        "server_name": "MCP Ripgrep Server",
        "tool_name": "search",
        "description": "Search files for specific patterns using regex-based queries, filter by file type, and display context lines. Supports case sensitivity, color output, and result limits for efficient text analysis."
      },
      {
        "tool_id": "Code Index MCP::search_code",
        "server_name": "Code Index MCP",
        "tool_name": "search_code",
        "description": "Query indexed code files to find specific patterns. Map results to filenames with associated line numbers and content. Configure case sensitivity and file extensions for precise searches."
      }
    ]
  },
  {
    "set_id": 11,
    "size": 3,
    "tools": [
      {
        "tool_id": "Luno MCP Server::get_tickers",
        "server_name": "Luno MCP Server",
        "tool_name": "get_tickers",
        "description": "Retrieve ticker data for specific currency pairs on the Luno MCP Server. Use this tool to access market information for trading and analysis purposes."
      },
      {
        "tool_id": "CCXT MCP Server::fetchTicker",
        "server_name": "CCXT MCP Server",
        "tool_name": "fetchTicker",
        "description": "Retrieve real-time ticker data for a specified trading pair on a cryptocurrency exchange using the CCXT MCP Server. Input the exchange ID and symbol to access price, volume, and market info."
      },
      {
        "tool_id": "Luno MCP Server::get_ticker",
        "server_name": "Luno MCP Server",
        "tool_name": "get_ticker",
        "description": "Retrieve real-time ticker data for specific cryptocurrency trading pairs on the Luno MCP Server to monitor market prices and trading activity."
      }
    ]
  },
  {
    "set_id": 12,
    "size": 2,
    "tools": [
      {
        "tool_id": "MCP Server Template for Cursor IDE::figma_design",
        "server_name": "MCP Server Template for Cursor IDE",
        "tool_name": "figma_design",
        "description": "Extract Figma design data, including structure and images, by providing a Figma design URL. Integrates with Cursor IDE via the MCP Server Template for streamlined design access."
      },
      {
        "tool_id": "Figma MCP Server::add_figma_file",
        "server_name": "Figma MCP Server",
        "tool_name": "add_figma_file",
        "description": "Integrate a Figma file into your context by providing its URL, enabling Cursor to access design data through the Figma MCP Server for enhanced code generation."
      }
    ]
  },
  {
    "set_id": 13,
    "size": 2,
    "tools": [
      {
        "tool_id": "WatchBase MCP Server::search",
        "server_name": "WatchBase MCP Server",
        "tool_name": "search",
        "description": "Query the WatchBase database using brand, family, watch names, or reference numbers to retrieve comprehensive watch metadata and technical details."
      },
      {
        "tool_id": "WatchBase MCP Server::search_refnr",
        "server_name": "WatchBase MCP Server",
        "tool_name": "search_refnr",
        "description": "Query the WatchBase database by reference number to retrieve detailed watch metadata, supporting partial matches for flexible searches."
      }
    ]
  },
  {
    "set_id": 14,
    "size": 2,
    "tools": [
      {
        "tool_id": "Markdownify MCP Server - UTF-8 Enhanced::youtube-to-markdown",
        "server_name": "Markdownify MCP Server - UTF-8 Enhanced",
        "tool_name": "youtube-to-markdown",
        "description": "Transform a YouTube video URL into markdown format with optional transcript extraction using enhanced UTF-8 support."
      },
      {
        "tool_id": "Markdownify MCP Server::youtube-to-markdown",
        "server_name": "Markdownify MCP Server",
        "tool_name": "youtube-to-markdown",
        "description": "Convert YouTube videos into Markdown format, including available transcripts, making content easy to read and share using Markdownify MCP Server."
      }
    ]
  },
  {
    "set_id": 15,
    "size": 3,
    "tools": [
      {
        "tool_id": "Ethereum RPC MCP Server::eth_call",
        "server_name": "Ethereum RPC MCP Server",
        "tool_name": "eth_call",
        "description": "Execute a call to a contract function without creating a transaction on the Ethereum blockchain. Use directly to query smart contract data, check execution outputs, or simulate transactions."
      },
      {
        "tool_id": "MetaMask MCP::call",
        "server_name": "MetaMask MCP",
        "tool_name": "call",
        "description": "Execute instant message calls to smart contracts or recipients without submitting transactions to the blockchain, using encoded data and specified values in wei."
      },
      {
        "tool_id": "MCP Ethers Wallet::contractCall",
        "server_name": "MCP Ethers Wallet",
        "tool_name": "contractCall",
        "description": "Execute read-only smart contract methods by specifying the contract address, ABI, and method name. Query blockchain data without altering the state."
      }
    ]
  },
  {
    "set_id": 16,
    "size": 3,
    "tools": [
      {
        "tool_id": "MCP Ethers Wallet::lookupAddress",
        "server_name": "MCP Ethers Wallet",
        "tool_name": "lookupAddress",
        "description": "Resolve an Ethereum address to its ENS name using the MCP Ethers Wallet. Input the address, and optionally specify a chain ID or provider for accurate network resolution."
      },
      {
        "tool_id": "MetaMask MCP::get-ens-name",
        "server_name": "MetaMask MCP",
        "tool_name": "get-ens-name",
        "description": "Retrieve the primary ENS name associated with an Ethereum address using MetaMask MCP. Specify the address, chain ID, and optional block number to fetch the name securely."
      },
      {
        "tool_id": "MCP Etherscan Server::get-ens-name",
        "server_name": "MCP Etherscan Server",
        "tool_name": "get-ens-name",
        "description": "Retrieve the ENS name associated with an Ethereum address using the mcp-otc server. Input a valid 0x-formatted address to resolve its corresponding ENS domain."
      }
    ]
  },
  {
    "set_id": 17,
    "size": 2,
    "tools": [
      {
        "tool_id": "Model Context Protocol TypeScript Implementation::write",
        "server_name": "Model Context Protocol TypeScript Implementation",
        "tool_name": "write",
        "description": "Modify or create file content with operations like write, append, replace, or edit using structured input. Simplifies file management for developers and AI integration on the MCP-PIF Server platform."
      },
      {
        "tool_id": "Claude Code MCP Server::claude_file_edit",
        "server_name": "Claude Code MCP Server",
        "tool_name": "claude_file_edit",
        "description": "Edit files directly by providing a file path and free-text instructions. This tool bypasses permission interruptions, enabling quick and precise file modifications without manual intervention."
      }
    ]
  },
  {
    "set_id": 18,
    "size": 2,
    "tools": [
      {
        "tool_id": "MCP Architect::analyze_architecture",
        "server_name": "MCP Architect",
        "tool_name": "analyze_architecture",
        "description": "Evaluate software architecture by analyzing constraints, requirements, and domain specifics to ensure alignment with design goals and operational needs."
      },
      {
        "tool_id": "MCP Architect::evaluate_architecture",
        "server_name": "MCP Architect",
        "tool_name": "evaluate_architecture",
        "description": "Assess an architecture design using predefined criteria to ensure alignment with domain-specific requirements, enhancing design quality and suitability."
      }
    ]
  },
  {
    "set_id": 19,
    "size": 3,
    "tools": [
      {
        "tool_id": "playwright-server MCP server::playwright_fill",
        "server_name": "playwright-server MCP server",
        "tool_name": "playwright_fill",
        "description": "Fill web input fields using CSS selectors to automate user interactions. Specify the selector and value for precise web automation tasks."
      },
      {
        "tool_id": "Visual UI Debug Agent MCP::playwright_fill",
        "server_name": "Visual UI Debug Agent MCP",
        "tool_name": "playwright_fill",
        "description": "Automate filling input fields using CSS selectors in web interfaces, enabling precise UI testing and interaction scripting for web applications."
      },
      {
        "tool_id": "Puppeteer MCP Server::puppeteer_fill",
        "server_name": "Puppeteer MCP Server",
        "tool_name": "puppeteer_fill",
        "description": "Automatically fill input fields on web pages using a CSS selector and specified value to streamline browser automation tasks."
      }
    ]
  },
  {
    "set_id": 20,
    "size": 2,
    "tools": [
      {
        "tool_id": "mcp-editor::view",
        "server_name": "mcp-editor",
        "tool_name": "view",
        "description": "Access and display file contents or directory listings by specifying an absolute path. Optionally, view specific line ranges within files to streamline navigation and analysis."
      },
      {
        "tool_id": "Coding Assistant Server::read_file",
        "server_name": "Coding Assistant Server",
        "tool_name": "read_file",
        "description": "Retrieve the full text or specific lines from a file on the MCP server Serena by specifying the relative path, start line, and end line. Use this tool when granular file access is needed for task exec..."
      }
    ]
  },
  {
    "set_id": 21,
    "size": 2,
    "tools": [
      {
        "tool_id": "ReviewWebsite.com - MCP Server::summarize_url",
        "server_name": "ReviewWebsite.com - MCP Server",
        "tool_name": "summarize_url",
        "description": "Generate concise summaries of web content from any URL using AI. Customize the output format, length, and instructions to suit your needs. Ideal for quick insights or content extraction."
      },
      {
        "tool_id": "Cloudflare Browser Rendering Experiments & MCP Server::summarize_content",
        "server_name": "Cloudflare Browser Rendering Experiments & MCP Server",
        "tool_name": "summarize_content",
        "description": "Extract and condense key information from web pages using a URL, optimizing content length for LLM context with customizable summary size."
      }
    ]
  },
  {
    "set_id": 22,
    "size": 2,
    "tools": [
      {
        "tool_id": "shell-mcp::shell_whois",
        "server_name": "shell-mcp",
        "tool_name": "shell_whois",
        "description": "Query WHOIS domain registration details directly from the command line using a secure MCP server. Retrieve domain ownership, expiry, and registrar information for integration with Claude and other MCP..."
      },
      {
        "tool_id": "Whois MCP::whois_domain",
        "server_name": "Whois MCP",
        "tool_name": "whois_domain",
        "description": "Retrieve WHOIS information for a domain to check availability, ownership, and registration details using the Whois MCP server."
      }
    ]
  },
  {
    "set_id": 23,
    "size": 3,
    "tools": [
      {
        "tool_id": "FileScopeMCP (Model Context Protocol) Server::list_files",
        "server_name": "FileScopeMCP (Model Context Protocol) Server",
        "tool_name": "list_files",
        "description": "Identify and rank files by importance in your codebase to understand project structure and dependencies using the FileScopeMCP server."
      },
      {
        "tool_id": "FileScopeMCP (Model Context Protocol) Server::find_important_files",
        "server_name": "FileScopeMCP (Model Context Protocol) Server",
        "tool_name": "find_important_files",
        "description": "Rank and identify key files in your codebase by importance using a customizable scoring system, helping developers prioritize and understand code structure efficiently."
      },
      {
        "tool_id": "FileScopeMCP (Model Context Protocol) Server::get_file_importance",
        "server_name": "FileScopeMCP (Model Context Protocol) Server",
        "tool_name": "get_file_importance",
        "description": "Analyze and rank files in your codebase by importance using FileScopeMCP to identify critical dependencies and improve code structure understanding."
      }
    ]
  },
  {
    "set_id": 24,
    "size": 5,
    "tools": [
      {
        "tool_id": "FinanceMCP::stock_data",
        "server_name": "FinanceMCP",
        "tool_name": "stock_data",
        "description": "Retrieve historical stock market data such as open, high, low, close, and volume for specified tickers and date ranges. Input stock code, start and end dates, and desired fields to access accurate fin..."
      },
      {
        "tool_id": "Financial Modeling Prep MCP Server::get_historical_stock_prices",
        "server_name": "Financial Modeling Prep MCP Server",
        "tool_name": "get_historical_stock_prices",
        "description": "Retrieve historical stock prices for a specified ticker, including date, open, high, low, close, and volume. Customize the period and interval for detailed or long-term price analysis using Yahoo Fina..."
      },
      {
        "tool_id": "xtquantai::get_history_market_data",
        "server_name": "xtquantai",
        "tool_name": "get_history_market_data",
        "description": "Retrieve historical market data for specified stock codes, including customizable date ranges, fields, and periods, to support quantitative trading analysis."
      },
      {
        "tool_id": "kospi-kosdaq-stock-server::get_stock_ohlcv",
        "server_name": "kospi-kosdaq-stock-server",
        "tool_name": "get_stock_ohlcv",
        "description": "Fetch OHLCV (Open/High/Low/Close/Volume) data for specific stocks within a defined date range. Specify ticker symbol, date parameters, and choose adjusted or unadjusted prices for accurate analysis."
      },
      {
        "tool_id": "Twelve Data MCP Server::GetTimeSeries",
        "server_name": "Twelve Data MCP Server",
        "tool_name": "GetTimeSeries",
        "description": "Retrieve historical financial time series data for instruments, including open, high, low, close prices, and volume. Customize data retrieval by symbol, interval, timezone, and date range for accurate..."
      }
    ]
  },
  {
    "set_id": 25,
    "size": 3,
    "tools": [
      {
        "tool_id": "MCP Image Extractor::extract_image_from_file",
        "server_name": "MCP Image Extractor",
        "tool_name": "extract_image_from_file",
        "description": "Extracts and resizes images from files (PNG, JPG, GIF, WebP) to 512x512 dimensions, optimizing them for LLM analysis to enable AI models to process visual content effectively."
      },
      {
        "tool_id": "MCP Image Extractor::extract_image_from_url",
        "server_name": "MCP Image Extractor",
        "tool_name": "extract_image_from_url",
        "description": "Extract and resize images from URLs for AI analysis. Automatically adjusts dimensions to 512x512 for optimal processing in visual content, text extraction, or object recognition tasks."
      },
      {
        "tool_id": "MCP Image Extractor::extract_image_from_base64",
        "server_name": "MCP Image Extractor",
        "tool_name": "extract_image_from_base64",
        "description": "Convert Base64-encoded image data into a resized format optimized for LLM analysis, enabling AI models to process and interpret visual content effectively."
      }
    ]
  },
  {
    "set_id": 26,
    "size": 2,
    "tools": [
      {
        "tool_id": "blastengine-mailer MCP Server::send_email",
        "server_name": "blastengine-mailer MCP Server",
        "tool_name": "send_email",
        "description": "Send custom emails via the Blastengine API by specifying sender, recipient, subject, and body content using the blastengine-mailer MCP server."
      },
      {
        "tool_id": "MCP Headless Gmail Server::gmail_send_email",
        "server_name": "MCP Headless Gmail Server",
        "tool_name": "gmail_send_email",
        "description": "Send emails via Gmail using a headless server. Authenticate with a Google OAuth2 token, specify recipient, subject, and body. Supports plain text or HTML content for streamlined email delivery."
      }
    ]
  },
  {
    "set_id": 27,
    "size": 2,
    "tools": [
      {
        "tool_id": "MCP Google Sheets Server::sheets_update_values",
        "server_name": "MCP Google Sheets Server",
        "tool_name": "sheets_update_values",
        "description": "Update specific ranges in Google Sheets with a 2D array of values. Supports fixed or flexible ranges, ensuring accurate data insertion and row count alignment. Ideal for batch updates."
      },
      {
        "tool_id": "MCP Google Sheets Server::sheets_batch_update_values",
        "server_name": "MCP Google Sheets Server",
        "tool_name": "sheets_batch_update_values",
        "description": "Update multiple ranges in a Google Sheets spreadsheet with new values in one request. Specify spreadsheet ID, range-value pairs, and input interpretation (RAW or USER_ENTERED)."
      }
    ]
  },
  {
    "set_id": 28,
    "size": 2,
    "tools": [
      {
        "tool_id": "ReviewWebsite.com - MCP Server::summarize_website",
        "server_name": "ReviewWebsite.com - MCP Server",
        "tool_name": "summarize_website",
        "description": "Generate concise summaries of websites, including multiple pages, using AI. Customize instructions, model, and format (bullet points or paragraph) for tailored results via ReviewWebsite API."
      },
      {
        "tool_id": "ReviewWebsite.com - MCP Server::summarize_multiple_urls",
        "server_name": "ReviewWebsite.com - MCP Server",
        "tool_name": "summarize_multiple_urls",
        "description": "Summarize content from multiple URLs with AI, customizing instructions, format, and length. Ideal for quick insights from web pages using ReviewWebsite API."
      }
    ]
  },
  {
    "set_id": 29,
    "size": 2,
    "tools": [
      {
        "tool_id": "Slowtime MCP Server::sha256",
        "server_name": "Slowtime MCP Server",
        "tool_name": "sha256",
        "description": "Generate SHA-256 hash for any input string using this secure and reliable tool within the Crypto_MCP server, ensuring data integrity and cryptographic verification."
      },
      {
        "tool_id": "Slowtime MCP Server::md5",
        "server_name": "Slowtime MCP Server",
        "tool_name": "md5",
        "description": "Generate MD5 hash from an input string using the Crypto_MCP server for secure data handling and integrity verification."
      }
    ]
  },
  {
    "set_id": 30,
    "size": 2,
    "tools": [
      {
        "tool_id": "playwright-server MCP server::playwright_get_html_content",
        "server_name": "playwright-server MCP server",
        "tool_name": "playwright_get_html_content",
        "description": "Extract HTML content from a specific webpage element using a CSS selector for web automation and analysis with Playwright Server MCP."
      },
      {
        "tool_id": "MCP Web Browser Server::browse_webpage",
        "server_name": "MCP Web Browser Server",
        "tool_name": "browse_webpage",
        "description": "Extract webpage content by providing a URL, with optional CSS selectors to target specific elements for precise data retrieval."
      }
    ]
  },
  {
    "set_id": 31,
    "size": 2,
    "tools": [
      {
        "tool_id": "IntelliPlan MCP::createDirectPlanningConfig",
        "server_name": "IntelliPlan MCP",
        "tool_name": "createDirectPlanningConfig",
        "description": "Generate a JSON configuration file for planning processes with detailed steps, prompts, and instructions, ensuring structured and organized task hierarchies."
      },
      {
        "tool_id": "IntelliPlan MCP::createPlanningConfig",
        "server_name": "IntelliPlan MCP",
        "tool_name": "createPlanningConfig",
        "description": "Generate a customizable JSON configuration file for planning processes, defining steps, instructions, prompts, and order to streamline project execution with the IntelliPlan server."
      }
    ]
  },
  {
    "set_id": 32,
    "size": 2,
    "tools": [
      {
        "tool_id": "Visual UI Debug Agent MCP::playwright_hover",
        "server_name": "Visual UI Debug Agent MCP",
        "tool_name": "playwright_hover",
        "description": "Simulate mouse hover over a specified webpage element using a CSS selector for precise UI interaction testing and debugging."
      },
      {
        "tool_id": "Puppeteer MCP Server::puppeteer_hover",
        "server_name": "Puppeteer MCP Server",
        "tool_name": "puppeteer_hover",
        "description": "Simulate a hover action on a specific webpage element using its CSS selector, enabling precise interaction during browser automation with Puppeteer."
      }
    ]
  },
  {
    "set_id": 33,
    "size": 3,
    "tools": [
      {
        "tool_id": "Semgrep MCP Server::start_scan",
        "server_name": "Semgrep MCP Server",
        "tool_name": "start_scan",
        "description": "Initiate a Semgrep scan to detect code vulnerabilities, monitor progress via notifications, and analyze results using specified configurations for targeted files or directories."
      },
      {
        "tool_id": "Semgrep MCP Server::semgrep_scan",
        "server_name": "Semgrep MCP Server",
        "tool_name": "semgrep_scan",
        "description": "Run static code analysis on provided files using Semgrep to detect vulnerabilities and return findings in JSON format for detailed inspection and remediation."
      },
      {
        "tool_id": "Semgrep MCP Server::start_scan_from_content",
        "server_name": "Semgrep MCP Server",
        "tool_name": "start_scan_from_content",
        "description": "Initiate a Semgrep scan using directly provided code content to identify security vulnerabilities. Input code files and configuration to generate detailed scan results."
      }
    ]
  },
  {
    "set_id": 34,
    "size": 2,
    "tools": [
      {
        "tool_id": "Financial News and Notes MCP Server::my-tool",
        "server_name": "Financial News and Notes MCP Server",
        "tool_name": "my-tool",
        "description": "Process and analyze financial messages for insights, enabling efficient integration with the Financial News and Notes MCP Server to query and manage stock data, news, and notes."
      },
      {
        "tool_id": "Financial News and Notes MCP Server::data-processor",
        "server_name": "Financial News and Notes MCP Server",
        "tool_name": "data-processor",
        "description": "Extract and process financial data and notes into actionable insights using structured inputs. Integrates with the 'Financial News and Notes MCP Server' for streamlined querying and analysis."
      }
    ]
  },
  {
    "set_id": 35,
    "size": 6,
    "tools": [
      {
        "tool_id": "Markdownify MCP Server - UTF-8 Enhanced::bing-search-to-markdown",
        "server_name": "Markdownify MCP Server - UTF-8 Enhanced",
        "tool_name": "bing-search-to-markdown",
        "description": "Transform Bing search results into markdown format for easier documentation and integration with Markdown workflows using the Markdownify MCP Server."
      },
      {
        "tool_id": "Markdownify MCP Server::bing-search-to-markdown",
        "server_name": "Markdownify MCP Server",
        "tool_name": "bing-search-to-markdown",
        "description": "Transform Bing search results into Markdown format for easy readability and sharing by providing the search results URL."
      },
      {
        "tool_id": "pure.md MCP server::search-web",
        "server_name": "pure.md MCP server",
        "tool_name": "search-web",
        "description": "Enables AI clients to retrieve web content in markdown format by searching specific queries, facilitating access to web information directly within supported platforms."
      },
      {
        "tool_id": "Graphlit MCP Server::webSearch",
        "server_name": "Graphlit MCP Server",
        "tool_name": "webSearch",
        "description": "Execute web searches for pages, podcasts, videos, images, news, or shopping using a query string. Choose search services like Tavily or Exa, and retrieve URL, title, and Markdown text from results wit..."
      },
      {
        "tool_id": "mcp-tavily-search::tavily_get_search_context",
        "server_name": "mcp-tavily-search",
        "tool_name": "tavily_get_search_context",
        "description": "Extract context for RAG applications by processing web search queries using Tavily search API. Configure response format and token length for tailored results."
      },
      {
        "tool_id": "Model Context Protocol (MCP) Server for the RAG Web Browser Actor 🌐::search",
        "server_name": "Model Context Protocol (MCP) Server for the RAG Web Browser Actor 🌐",
        "tool_name": "search",
        "description": "Retrieve web page content from Google Search results or a specific URL in text or Markdown format, ideal for LLMs and RAG pipelines."
      }
    ]
  },
  {
    "set_id": 36,
    "size": 2,
    "tools": [
      {
        "tool_id": "BlenderMCP - Blender Model Context Protocol Integration::set_texture",
        "server_name": "BlenderMCP - Blender Model Context Protocol Integration",
        "tool_name": "set_texture",
        "description": "Apply designated Polyhaven textures to objects in Blender with specified object names and texture IDs. Confirm success or failure via return message."
      },
      {
        "tool_id": "Tripo MCP Server::set_texture",
        "server_name": "Tripo MCP Server",
        "tool_name": "set_texture",
        "description": "Apply a Polyhaven texture to a 3D object by specifying the object name and texture ID. Enables precise texture mapping for enhanced 3D asset customization within Blender."
      }
    ]
  },
  {
    "set_id": 37,
    "size": 2,
    "tools": [
      {
        "tool_id": "Puppeteer MCP Server::puppeteer_navigate",
        "server_name": "Puppeteer MCP Server",
        "tool_name": "puppeteer_navigate",
        "description": "Instructs the browser to navigate to a specified URL, enabling automated web page interaction as part of Puppeteer browser automation workflows."
      },
      {
        "tool_id": "playwright-server MCP server::playwright_navigate",
        "server_name": "playwright-server MCP server",
        "tool_name": "playwright_navigate",
        "description": "Automate web navigation by directing a browser to a specified URL, automatically initiating a session for seamless interaction and testing."
      }
    ]
  },
  {
    "set_id": 38,
    "size": 2,
    "tools": [
      {
        "tool_id": "Outlook Calendar MCP Tool::delete_event",
        "server_name": "Outlook Calendar MCP Tool",
        "tool_name": "delete_event",
        "description": "Remove a specific calendar event using its unique event ID. Works with Outlook Calendar MCP to delete events locally, ensuring data privacy and direct management of your Windows-based Outlook calendar..."
      },
      {
        "tool_id": "Outlook Meetings Scheduler MCP Server::delete-event",
        "server_name": "Outlook Meetings Scheduler MCP Server",
        "tool_name": "delete-event",
        "description": "Remove a calendar event in Microsoft Outlook by specifying its unique event ID, ensuring accurate updates to your schedule."
      }
    ]
  },
  {
    "set_id": 39,
    "size": 2,
    "tools": [
      {
        "tool_id": "Google Workspace MCP Server::delete_event",
        "server_name": "Google Workspace MCP Server",
        "tool_name": "delete_event",
        "description": "Remove a specific calendar event using its unique event ID to manage Google Calendar entries programmatically via the Google Workspace MCP Server."
      },
      {
        "tool_id": "Google MCP Tools::google_calendar_delete_event",
        "server_name": "Google MCP Tools",
        "tool_name": "google_calendar_delete_event",
        "description": "Remove an event from Google Calendar by specifying its event ID. Optionally, define the calendar ID or use the primary calendar by default."
      }
    ]
  },
  {
    "set_id": 40,
    "size": 2,
    "tools": [
      {
        "tool_id": "MCP Ethers Wallet::getERC20Balance",
        "server_name": "MCP Ethers Wallet",
        "tool_name": "getERC20Balance",
        "description": "Query the balance of ERC20 tokens for a specific Ethereum wallet address. Use the token contract address and optional chain or RPC details to retrieve accurate data on supported networks."
      },
      {
        "tool_id": "etherscan-mcp::get_token_balance",
        "server_name": "etherscan-mcp",
        "tool_name": "get_token_balance",
        "description": "Retrieve the balance of a specific token for a given Ethereum address, enabling users to monitor token holdings directly from the Ethereum blockchain."
      }
    ]
  },
  {
    "set_id": 41,
    "size": 2,
    "tools": [
      {
        "tool_id": "Knowledge Graph Memory Server::delete_entities",
        "server_name": "Knowledge Graph Memory Server",
        "tool_name": "delete_entities",
        "description": "Remove specified entities and their associated relations from the knowledge graph to maintain accurate and up-to-date memory storage."
      },
      {
        "tool_id": "mcp-knowledge-graph::delete_entities",
        "server_name": "mcp-knowledge-graph",
        "tool_name": "delete_entities",
        "description": "Remove specific entities and their related connections from a knowledge graph to manage and update stored information efficiently."
      }
    ]
  },
  {
    "set_id": 42,
    "size": 2,
    "tools": [
      {
        "tool_id": "Enhanced Documentation Search MCP Server::semantic_search",
        "server_name": "Enhanced Documentation Search MCP Server",
        "tool_name": "semantic_search",
        "description": "Perform semantic searches across multiple libraries to retrieve relevant results ranked by relevance scores, leveraging context for enhanced precision in documentation search."
      },
      {
        "tool_id": "RAG Documentation MCP Server::search_documentation",
        "server_name": "RAG Documentation MCP Server",
        "tool_name": "search_documentation",
        "description": "Find relevant information, code examples, or related documentation using natural language queries across stored sources. Returns ranked excerpts with context for specific searches. Optimize results by..."
      }
    ]
  },
  {
    "set_id": 43,
    "size": 2,
    "tools": [
      {
        "tool_id": "Bankless Onchain MCP Server::get_transaction_history_for_user",
        "server_name": "Bankless Onchain MCP Server",
        "tool_name": "get_transaction_history_for_user",
        "description": "Retrieve transaction history for a user on a specified blockchain network, optionally filter by contract, method ID, or block range, and include transaction data. Integrates with Bankless Onchain MCP ..."
      },
      {
        "tool_id": "Blockscout MCP Server::get_transactions_by_address",
        "server_name": "Blockscout MCP Server",
        "tool_name": "get_transactions_by_address",
        "description": "Retrieve transactions for a specific address within defined time ranges using Blockscout MCP Server. Filter by method signature to access detailed blockchain activity data for analysis."
      }
    ]
  },
  {
    "set_id": 44,
    "size": 2,
    "tools": [
      {
        "tool_id": "Alchemy MCP Server::fetchTokenPriceHistoryByTimeFrame",
        "server_name": "Alchemy MCP Server",
        "tool_name": "fetchTokenPriceHistoryByTimeFrame",
        "description": "Retrieve historical price data for specified tokens within defined time frames and intervals, supporting both structured queries and natural language inputs for flexible analysis."
      },
      {
        "tool_id": "Alchemy MCP Server::fetchTokenPriceHistoryBySymbol",
        "server_name": "Alchemy MCP Server",
        "tool_name": "fetchTokenPriceHistoryBySymbol",
        "description": "Retrieve historical token price data by specifying a symbol, time range, and interval using Alchemy MCP Server for accurate analysis."
      }
    ]
  },
  {
    "set_id": 45,
    "size": 3,
    "tools": [
      {
        "tool_id": "MCP LLM::ask_question",
        "server_name": "MCP LLM",
        "tool_name": "ask_question",
        "description": "Submit a question to receive an AI-generated response, optionally providing context for more accurate answers. Powered by the MCP-LLM server."
      },
      {
        "tool_id": "any-chat-completions-mcp MCP Server::chat-with-openai",
        "server_name": "any-chat-completions-mcp MCP Server",
        "tool_name": "chat-with-openai",
        "description": "Interact with OpenAI's chat completions to process and generate text responses using the Any Chat Completions MCP server for streamlined integration."
      },
      {
        "tool_id": "OpenRouter MCP Server::chat_completion",
        "server_name": "OpenRouter MCP Server",
        "tool_name": "chat_completion",
        "description": "Send and receive AI-generated responses using a variety of models for conversational tasks. Integrate with OpenRouter.ai to process messages and retrieve outputs efficiently."
      }
    ]
  },
  {
    "set_id": 46,
    "size": 2,
    "tools": [
      {
        "tool_id": "Bankless Onchain MCP Server::get_events",
        "server_name": "Bankless Onchain MCP Server",
        "tool_name": "get_events",
        "description": "Retrieve event logs from blockchain networks by specifying contract addresses, topics, and block ranges. Filter data to access targeted on-chain activity for analysis or monitoring."
      },
      {
        "tool_id": "Ethereum RPC MCP Server::eth_getLogs",
        "server_name": "Ethereum RPC MCP Server",
        "tool_name": "eth_getLogs",
        "description": "Retrieve Ethereum blockchain logs based on specified filter criteria, such as contract address, block range, or event topics, for detailed transaction analysis."
      }
    ]
  },
  {
    "set_id": 47,
    "size": 4,
    "tools": [
      {
        "tool_id": "Binance Cryptocurrency MCP::get_ui_klines",
        "server_name": "Binance Cryptocurrency MCP",
        "tool_name": "get_ui_klines",
        "description": "Retrieve historical candlestick (K-line) data for specified cryptocurrency pairs from Binance, enabling analysis of price trends and market behavior over custom timeframes and intervals."
      },
      {
        "tool_id": "Luno MCP Server::get_candles",
        "server_name": "Luno MCP Server",
        "tool_name": "get_candles",
        "description": "Retrieve candlestick market data for specified trading pairs and durations. Inputs include pair, duration, and optional timestamp to filter historical data."
      },
      {
        "tool_id": "Binance Cryptocurrency MCP::get_klines",
        "server_name": "Binance Cryptocurrency MCP",
        "tool_name": "get_klines",
        "description": "Retrieve Binance cryptocurrency candlestick data for a specified trading pair and time interval. Customize query with start/end timestamps, time zone, and limit to fetch up to 1000 K-lines for analysi..."
      },
      {
        "tool_id": "pcm::get-ohlcv",
        "server_name": "pcm",
        "tool_name": "get-ohlcv",
        "description": "Retrieve OHLCV candlestick data for specified trading pairs on exchanges like Binance or Coinbase. Fetch up to 1000 candles, adjust timeframes, and analyze market trends efficiently."
      }
    ]
  },
  {
    "set_id": 48,
    "size": 2,
    "tools": [
      {
        "tool_id": "Status Invest - MCP Server::get-acoes",
        "server_name": "Status Invest - MCP Server",
        "tool_name": "get-acoes",
        "description": "Retrieve essential stock information by providing an array of stock symbols through the Status Invest MCP Server, enabling quick access to key data for analysis."
      },
      {
        "tool_id": "Investidor10 - MCP Server::get-acoes",
        "server_name": "Investidor10 - MCP Server",
        "tool_name": "get-acoes",
        "description": "Retrieve essential stock information by inputting an array of stock symbols. Designed for fetching basic stock data within the Investidor10 MCP Server framework."
      }
    ]
  },
  {
    "set_id": 49,
    "size": 8,
    "tools": [
      {
        "tool_id": "ReviewWebsite.com - MCP Server::extract_data_multiple",
        "server_name": "ReviewWebsite.com - MCP Server",
        "tool_name": "extract_data_multiple",
        "description": "Extract structured data from multiple web URLs using AI, guided by instructions and a JSON template. Automates data collection for analysis or integration via the ReviewWebsite API."
      },
      {
        "tool_id": "Cloudflare Browser Rendering Experiments & MCP Server::extract_structured_content",
        "server_name": "Cloudflare Browser Rendering Experiments & MCP Server",
        "tool_name": "extract_structured_content",
        "description": "Extract structured data from web pages using CSS selectors for precise content retrieval, enabling efficient data processing and analysis."
      },
      {
        "tool_id": "ScrapeGraph MCP Server::smartscraper",
        "server_name": "ScrapeGraph MCP Server",
        "tool_name": "smartscraper",
        "description": "Extract structured data from webpages using AI by specifying user prompts and URLs. Simplify web scraping with precision by transforming webpage content into organized, actionable information."
      },
      {
        "tool_id": "ReviewWebsite.com - MCP Server::extract_data",
        "server_name": "ReviewWebsite.com - MCP Server",
        "tool_name": "extract_data",
        "description": "Extract structured data from any URL using AI. Input a URL, specify extraction instructions, and define a JSON template to organize the results. Intended for web data extraction and analysis."
      },
      {
        "tool_id": "Scrapezy::extract-structured-data",
        "server_name": "Scrapezy",
        "tool_name": "extract-structured-data",
        "description": "Extract structured data from websites using a specified URL and prompt. Integrate with Scrapezy to retrieve organized information for analysis or processing."
      },
      {
        "tool_id": "MCP Webscan Server::oxylabs_scraper",
        "server_name": "MCP Webscan Server",
        "tool_name": "oxylabs_scraper",
        "description": "Extract web content using Oxylabs Web Scraper API, enabling customizable parsing and rendering for efficient data retrieval from complex websites."
      },
      {
        "tool_id": "Firecrawl MCP Server::scrape_url",
        "server_name": "Firecrawl MCP Server",
        "tool_name": "scrape_url",
        "description": "Extract structured content from any URL with customizable options like ad blocking, mobile emulation, and include/exclude tags. Retrieve data in formats like markdown, HTML, or JSON using Firecrawl AP..."
      },
      {
        "tool_id": "Firecrawl MCP Server::extract",
        "server_name": "Firecrawl MCP Server",
        "tool_name": "extract",
        "description": "Extracts structured data from specified URLs using a defined schema, with options to include subdomains, ignore sitemaps, and use web search for enhanced results."
      }
    ]
  },
  {
    "set_id": 50,
    "size": 2,
    "tools": [
      {
        "tool_id": "FetchSERP MCP Server::get_keywords_search_volume",
        "server_name": "FetchSERP MCP Server",
        "tool_name": "get_keywords_search_volume",
        "description": "Retrieve search volume data for specific keywords to analyze search trends and prioritize SEO efforts. Supports country-specific insights for targeted keyword research."
      },
      {
        "tool_id": "DataForSEO MCP Server::keywords-google-ads-search-volume",
        "server_name": "DataForSEO MCP Server",
        "tool_name": "keywords-google-ads-search-volume",
        "description": "Retrieve search volume data for specific keywords from Google Ads to analyze keyword performance and optimize ad campaigns. Specify location and language for targeted insights."
      }
    ]
  },
  {
    "set_id": 51,
    "size": 2,
    "tools": [
      {
        "tool_id": "AdsPower LocalAPI MCP Server::get-browser-list",
        "server_name": "AdsPower LocalAPI MCP Server",
        "tool_name": "get-browser-list",
        "description": "Retrieve a list of browsers from AdsPower LocalAPI MCP Server based on criteria like group ID, serial number, or sorting order. Enables efficient management of browser profiles for specific tasks."
      },
      {
        "tool_id": "GoLogin MCP Server::BrowserController_getBrowserListNew",
        "server_name": "GoLogin MCP Server",
        "tool_name": "BrowserController_getBrowserListNew",
        "description": "Retrieve a comprehensive list of browser profiles managed by GoLogin, enabling efficient profile access and management for automation and configuration tasks."
      }
    ]
  },
  {
    "set_id": 52,
    "size": 3,
    "tools": [
      {
        "tool_id": "Gemini Image Generator MCP Server::transform_image_from_encoded",
        "server_name": "Gemini Image Generator MCP Server",
        "tool_name": "transform_image_from_encoded",
        "description": "Modify an encoded image using a text prompt with Google's Gemini model. Input a base64 image and a descriptive prompt to generate and save a transformed image file on the server."
      },
      {
        "tool_id": "4o-image MCP Server::generateImage",
        "server_name": "4o-image MCP Server",
        "tool_name": "generateImage",
        "description": "Create or edit images using text prompts or base images. Automatically opens results in your browser and provides direct links for easy access."
      },
      {
        "tool_id": "Gemini Image Generator MCP Server::transform_image_from_file",
        "server_name": "Gemini Image Generator MCP Server",
        "tool_name": "transform_image_from_file",
        "description": "Modify an existing image file using a text prompt to achieve desired transformations via Google's Gemini model. Input an image path and text description to generate the updated image."
      }
    ]
  },
  {
    "set_id": 53,
    "size": 2,
    "tools": [
      {
        "tool_id": "Yahoo Finance MCP Server::get_top_companies",
        "server_name": "Yahoo Finance MCP Server",
        "tool_name": "get_top_companies",
        "description": "Retrieve the top companies in a specified sector by providing the sector and desired number of companies. Utilize data from Yahoo Finance to analyze and identify leading industry players."
      },
      {
        "tool_id": "MCP Yeoman Server::get_top_companies",
        "server_name": "MCP Yeoman Server",
        "tool_name": "get_top_companies",
        "description": "Retrieve the top performing companies in a specified sector using the MCP server. Input a sector and the number of top companies to fetch for targeted insights."
      }
    ]
  },
  {
    "set_id": 54,
    "size": 3,
    "tools": [
      {
        "tool_id": "Luno MCP Server::get_order_book",
        "server_name": "Luno MCP Server",
        "tool_name": "get_order_book",
        "description": "Retrieve the order book for a specified trading pair using the Luno MCP Server. Access buy and sell orders to analyze market depth and liquidity."
      },
      {
        "tool_id": "Binance Cryptocurrency MCP::get_order_book",
        "server_name": "Binance Cryptocurrency MCP",
        "tool_name": "get_order_book",
        "description": "Retrieve real-time order book data for Binance cryptocurrency trading pairs. Specify symbol and depth to access bid-ask prices and quantities, enabling AI agents to analyze market liquidity and tradin..."
      },
      {
        "tool_id": "CCXT MCP Server::fetchOrderBook",
        "server_name": "CCXT MCP Server",
        "tool_name": "fetchOrderBook",
        "description": "Retrieve the order book for a specified trading symbol on a cryptocurrency exchange, including bid and ask orders, to analyze market depth and liquidity. Integrates with over 100 exchanges via the CCX..."
      }
    ]
  },
  {
    "set_id": 55,
    "size": 2,
    "tools": [
      {
        "tool_id": "Peekaboo MCP: Lightning-fast macOS Screenshots 🚀::analyze",
        "server_name": "Peekaboo MCP: Lightning-fast macOS Screenshots 🚀",
        "tool_name": "analyze",
        "description": "Analyze stored image files to understand content, extract text, or answer questions using AI. Configure the tool to use specific AI models or rely on server defaults for tasks like object identificati..."
      },
      {
        "tool_id": "MCP OpenVision::image_analysis",
        "server_name": "MCP OpenVision",
        "tool_name": "image_analysis",
        "description": "Analyze images with OpenRouter's vision models by providing a query and optional system prompt. Use this tool for detailed visual insights, object identification, or competitive analysis in AI-driven ..."
      }
    ]
  },
  {
    "set_id": 56,
    "size": 2,
    "tools": [
      {
        "tool_id": "Todo List MCP Server::complete-todo",
        "server_name": "Todo List MCP Server",
        "tool_name": "complete-todo",
        "description": "Mark a todo item as completed by providing its unique ID using the Todo List MCP Server tool for efficient task management."
      },
      {
        "tool_id": "Enhanced Todoist MCP Server Extended::todoist_complete_task",
        "server_name": "Enhanced Todoist MCP Server Extended",
        "tool_name": "todoist_complete_task",
        "description": "Mark a Todoist task as completed using its unique ID, enabling efficient task management through the Enhanced Todoist MCP Server."
      }
    ]
  },
  {
    "set_id": 57,
    "size": 2,
    "tools": [
      {
        "tool_id": "EVM MCP Server::is_contract",
        "server_name": "EVM MCP Server",
        "tool_name": "is_contract",
        "description": "Verify if an address is a smart contract or an externally owned account (EOA) on Ethereum and EVM-compatible networks using a unified interface."
      },
      {
        "tool_id": "BNBChain MCP (Model Context Protocol)::is_contract",
        "server_name": "BNBChain MCP (Model Context Protocol)",
        "tool_name": "is_contract",
        "description": "Verify whether a given address is a smart contract or an externally owned account (EOA) on supported networks, including BSC, Ethereum, and more."
      }
    ]
  },
  {
    "set_id": 58,
    "size": 2,
    "tools": [
      {
        "tool_id": "FetchSERP MCP Server::get_serp_html",
        "server_name": "FetchSERP MCP Server",
        "tool_name": "get_serp_html",
        "description": "Retrieve search engine results in HTML format by specifying query, engine, country, and page count for SEO analysis and web scraping."
      },
      {
        "tool_id": "FetchSERP MCP Server::get_serp_results",
        "server_name": "FetchSERP MCP Server",
        "tool_name": "get_serp_results",
        "description": "Retrieve search engine results for specific queries using FetchSERP MCP Server. Specify search engine, country, and page count to gather data for SEO analysis and research."
      }
    ]
  },
  {
    "set_id": 59,
    "size": 2,
    "tools": [
      {
        "tool_id": "Knowledge Graph Memory Server::add_observations",
        "server_name": "Knowledge Graph Memory Server",
        "tool_name": "add_observations",
        "description": "Enhance knowledge graphs by adding new observations to existing entities, enabling dynamic updates and enriched data insights for improved interaction and learning."
      },
      {
        "tool_id": "mcp-knowledge-graph::add_observations",
        "server_name": "mcp-knowledge-graph",
        "tool_name": "add_observations",
        "description": "Enhance knowledge graph entities by adding new observations, enabling persistent memory and information retention across interactions for improved context understanding."
      }
    ]
  },
  {
    "set_id": 60,
    "size": 2,
    "tools": [
      {
        "tool_id": "BNBChain MCP (Model Context Protocol)::approve_token_spending",
        "server_name": "BNBChain MCP (Model Context Protocol)",
        "tool_name": "approve_token_spending",
        "description": "Authorize a specific address to spend your ERC20 tokens by defining the token, spender, and amount. Essential for enabling token interactions with DeFi protocols or exchanges."
      },
      {
        "tool_id": "EVM MCP Server::approve_token_spending",
        "server_name": "EVM MCP Server",
        "tool_name": "approve_token_spending",
        "description": "Authorize a DeFi protocol or exchange to spend your ERC20 tokens by specifying the token address, spender address, and amount. Essential for enabling token interactions in decentralized applications."
      }
    ]
  },
  {
    "set_id": 61,
    "size": 2,
    "tools": [
      {
        "tool_id": "mcp-bocha::mcp-bocha_search",
        "server_name": "mcp-bocha",
        "tool_name": "mcp-bocha_search",
        "description": "Search the web using advanced filters like time range, domain inclusion/exclusion, and summary extraction. Retrieve precise results tailored to your query."
      },
      {
        "tool_id": "mcp-tavily-search::tavily_search",
        "server_name": "mcp-tavily-search",
        "tool_name": "tavily_search",
        "description": "Perform web searches with Tavily API for high-quality, factual results. Filter domains, set relevancy scores, and include AI-generated answers. Configure search depth and response formats for precise,..."
      }
    ]
  },
  {
    "set_id": 62,
    "size": 2,
    "tools": [
      {
        "tool_id": "Zoom Transcript MCP Server::download_transcript",
        "server_name": "Zoom Transcript MCP Server",
        "tool_name": "download_transcript",
        "description": "Download Zoom meeting transcripts to local storage by specifying the meeting ID or UUID. Access and manage recorded meeting data efficiently."
      },
      {
        "tool_id": "Attendee MCP Server::get_meeting_transcript",
        "server_name": "Attendee MCP Server",
        "tool_name": "get_meeting_transcript",
        "description": "Retrieve meeting transcripts directly from a bot using its unique ID. Simplify access to recorded discussions for review or documentation."
      }
    ]
  },
  {
    "set_id": 63,
    "size": 2,
    "tools": [
      {
        "tool_id": "Proofly MCP Integration::analyze-image",
        "server_name": "Proofly MCP Integration",
        "tool_name": "analyze-image",
        "description": "Detect deepfakes in images by analyzing base64-encoded data. Verify image authenticity using Proofly’s API with options for JSON or text output."
      },
      {
        "tool_id": "Proofly MCP Integration::analyze",
        "server_name": "Proofly MCP Integration",
        "tool_name": "analyze",
        "description": "Detect deepfakes by analyzing images from a URL using Proofly MCP Integration. Supports JSON or text output formats for authenticity verification."
      }
    ]
  },
  {
    "set_id": 64,
    "size": 3,
    "tools": [
      {
        "tool_id": "BNBChain MCP (Model Context Protocol)::get_block_by_number",
        "server_name": "BNBChain MCP (Model Context Protocol)",
        "tool_name": "get_block_by_number",
        "description": "Retrieve block details by specifying the block number and network for BNB Chain or other supported networks. Defaults to BSC mainnet if no network is provided."
      },
      {
        "tool_id": "BNBChain MCP (Model Context Protocol)::get_block_by_hash",
        "server_name": "BNBChain MCP (Model Context Protocol)",
        "tool_name": "get_block_by_hash",
        "description": "Retrieve blockchain block details using a specific block hash. Supports multiple networks, including BSC, Ethereum, and others, with BSC mainnet as default."
      },
      {
        "tool_id": "EVM MCP Server::get_block_by_number",
        "server_name": "EVM MCP Server",
        "tool_name": "get_block_by_number",
        "description": "Retrieve blockchain block details by specifying the block number and network using the EVM MCP Server. Supports Ethereum and other compatible networks for efficient data access."
      }
    ]
  },
  {
    "set_id": 65,
    "size": 2,
    "tools": [
      {
        "tool_id": "mem0 Memory System::add_memory",
        "server_name": "mem0 Memory System",
        "tool_name": "add_memory",
        "description": "Store and associate text-based memories in the mem0 Memory System by providing content, user ID, and optional metadata, agent ID, or session ID for enhanced organization and retrieval."
      },
      {
        "tool_id": "Letta MCP Server::create_memory_block",
        "server_name": "Letta MCP Server",
        "tool_name": "create_memory_block",
        "description": "Generate a new memory block in the Letta system, assigning a label, name, content, and optional metadata. Supports agent-specific memory allocation for organized data management."
      }
    ]
  },
  {
    "set_id": 66,
    "size": 2,
    "tools": [
      {
        "tool_id": "Gmail MCP::list_messages",
        "server_name": "Gmail MCP",
        "tool_name": "list_messages",
        "description": "Retrieve and filter messages from a Gmail mailbox using optional parameters like label IDs, search queries, and result limits. Supports inclusion of spam/trash messages and HTML body content."
      },
      {
        "tool_id": "Google Workspace MCP Server::search_emails",
        "server_name": "Google Workspace MCP Server",
        "tool_name": "search_emails",
        "description": "Search and filter emails in your Google Workspace account using advanced Gmail queries. Retrieve specific messages by sender, recipient, subject, attachments, date range, or unread status, with custom..."
      }
    ]
  },
  {
    "set_id": 67,
    "size": 2,
    "tools": [
      {
        "tool_id": "Puppeteer MCP Server::puppeteer_screenshot",
        "server_name": "Puppeteer MCP Server",
        "tool_name": "puppeteer_screenshot",
        "description": "Capture web page or element screenshots using CSS selectors and custom dimensions for precise browser automation and interaction tasks."
      },
      {
        "tool_id": "playwright-server MCP server::playwright_screenshot",
        "server_name": "playwright-server MCP server",
        "tool_name": "playwright_screenshot",
        "description": "Capture screenshots of web pages or specific elements using CSS selectors for web automation and testing purposes with Playwright."
      }
    ]
  },
  {
    "set_id": 68,
    "size": 4,
    "tools": [
      {
        "tool_id": "DocsFetcher MCP Server::fetch-multilingual-docs",
        "server_name": "DocsFetcher MCP Server",
        "tool_name": "fetch-multilingual-docs",
        "description": "Retrieve comprehensive documentation for software packages across multiple programming languages, enabling detailed insights without API keys for LLMs like Claude."
      },
      {
        "tool_id": "DocsFetcher MCP Server::fetch-library-docs",
        "server_name": "DocsFetcher MCP Server",
        "tool_name": "fetch-library-docs",
        "description": "Extract comprehensive library documentation for JavaScript, Python, Java, and other programming languages without API keys, enabling efficient access for LLM use cases."
      },
      {
        "tool_id": "DocsFetcher MCP Server::fetch-package-docs",
        "server_name": "DocsFetcher MCP Server",
        "tool_name": "fetch-package-docs",
        "description": "Retrieve detailed package documentation for various programming languages (JavaScript, Python, Java, etc.) to support LLMs like Claude, eliminating the need for API keys."
      },
      {
        "tool_id": "DocsFetcher MCP Server::fetch-url-docs",
        "server_name": "DocsFetcher MCP Server",
        "tool_name": "fetch-url-docs",
        "description": "Fetch and extract detailed package documentation from URLs across multiple programming language ecosystems for LLMs like Claude, without requiring API keys."
      }
    ]
  },
  {
    "set_id": 69,
    "size": 2,
    "tools": [
      {
        "tool_id": "Unconventional-thinking MCP server::generate_unreasonable_thought",
        "server_name": "Unconventional-thinking MCP server",
        "tool_name": "generate_unreasonable_thought",
        "description": "Generate unconventional ideas to challenge conventional thinking and solve problems by exploring rebellious or alternative perspectives."
      },
      {
        "tool_id": "Unconventional-thinking MCP server::branch_thought",
        "server_name": "Unconventional-thinking MCP server",
        "tool_name": "branch_thought",
        "description": "Generate alternative perspectives by branching from an existing idea, exploring directions like opposite, extreme, or tangential for creative problem-solving. Enables unconventional thinking strategie..."
      }
    ]
  },
  {
    "set_id": 70,
    "size": 2,
    "tools": [
      {
        "tool_id": "Harvest Natural Language Time Entry MCP Server::get_time_report",
        "server_name": "Harvest Natural Language Time Entry MCP Server",
        "tool_name": "get_time_report",
        "description": "Generate time reports from Harvest using plain language queries, such as 'Show time report for last week' or 'Summarize hours for Project Y.'"
      },
      {
        "tool_id": "Clockify MCP Server::getSummaryReport",
        "server_name": "Clockify MCP Server",
        "tool_name": "getSummaryReport",
        "description": "Generate a summary report of hours by user and project for a specified date range. Optional filters include userIds and projectIds for detailed insights."
      }
    ]
  },
  {
    "set_id": 71,
    "size": 2,
    "tools": [
      {
        "tool_id": "Clockify MCP Server::getUserTimeEntriesByName",
        "server_name": "Clockify MCP Server",
        "tool_name": "getUserTimeEntriesByName",
        "description": "Retrieve time entries for a user by name (case-insensitive, partial match supported) within specified date ranges using ISO8601 format. Simplify time tracking and reporting."
      },
      {
        "tool_id": "Clockify MCP Server::getUserTimeEntries",
        "server_name": "Clockify MCP Server",
        "tool_name": "getUserTimeEntries",
        "description": "Retrieve time entries for a specific user within a defined period using Clockify MCP. Specify user ID and optional start/end dates in ISO8601 format for precise tracking."
      }
    ]
  },
  {
    "set_id": 72,
    "size": 2,
    "tools": [
      {
        "tool_id": "Markdownify MCP Server::pdf-to-markdown",
        "server_name": "Markdownify MCP Server",
        "tool_name": "pdf-to-markdown",
        "description": "Convert PDF files to Markdown format with Markdownify MCP Server. Transform PDF content into structured, readable Markdown text for easy sharing and editing."
      },
      {
        "tool_id": "Markdownify MCP Server - UTF-8 Enhanced::pdf-to-markdown",
        "server_name": "Markdownify MCP Server - UTF-8 Enhanced",
        "tool_name": "pdf-to-markdown",
        "description": "Convert PDF files to Markdown format using a document conversion server with enhanced multilingual and UTF-8 support for structured text extraction."
      }
    ]
  },
  {
    "set_id": 73,
    "size": 2,
    "tools": [
      {
        "tool_id": "Meilisearch MCP Server::add-documents",
        "server_name": "Meilisearch MCP Server",
        "tool_name": "add-documents",
        "description": "Add structured data to a specified Meilisearch index to enhance search functionality, enabling efficient document storage and retrieval."
      },
      {
        "tool_id": "Elasticsearch MCP Server::bulk",
        "server_name": "Elasticsearch MCP Server",
        "tool_name": "bulk",
        "description": "Import large volumes of documents into an Elasticsearch index, specifying the target index and optional document ID field for efficient data handling."
      }
    ]
  },
  {
    "set_id": 74,
    "size": 2,
    "tools": [
      {
        "tool_id": "Kagi MCP server::search",
        "server_name": "Kagi MCP server",
        "tool_name": "search",
        "description": "Perform web searches with one or more queries on the Kagi MCP Server. Retrieve numbered results for easy reference, enabling users to access up-to-date information efficiently."
      },
      {
        "tool_id": "kagi-server MCP Server::kagi_search",
        "server_name": "kagi-server MCP Server",
        "tool_name": "kagi_search",
        "description": "Execute web searches via Kagi’s API, enabling precise results retrieval using query parameters and customizable limits for efficient data access."
      }
    ]
  },
  {
    "set_id": 75,
    "size": 3,
    "tools": [
      {
        "tool_id": "docs-mcp::semantic_search",
        "server_name": "docs-mcp",
        "tool_name": "semantic_search",
        "description": "Find semantically relevant content in Docs-MCP by inputting a query and optional limit. Enhances document search accuracy using OpenAI Embeddings."
      },
      {
        "tool_id": "Vectorize MCP Server::retrieve",
        "server_name": "Vectorize MCP Server",
        "tool_name": "retrieve",
        "description": "Retrieve specified number of documents from a Vectorize pipeline using a search term. Input pipeline ID, question, and desired document count for targeted document retrieval."
      },
      {
        "tool_id": "Build Agents with Needle MCP Server::needle_search",
        "server_name": "Build Agents with Needle MCP Server",
        "tool_name": "needle_search",
        "description": "Perform semantic search across documents using natural language queries. Retrieve relevant text passages with source information to find specific content, answer questions, or research topics efficien..."
      }
    ]
  },
  {
    "set_id": 76,
    "size": 2,
    "tools": [
      {
        "tool_id": "Yahoo Finance MCP Server::get_ticker_news",
        "server_name": "Yahoo Finance MCP Server",
        "tool_name": "get_ticker_news",
        "description": "Retrieve news articles for a specific stock ticker symbol using Yahoo Finance data. Input a ticker to access relevant financial news updates."
      },
      {
        "tool_id": "MCP Yeoman Server::get_ticker_news",
        "server_name": "MCP Yeoman Server",
        "tool_name": "get_ticker_news",
        "description": "Retrieve news articles for a specific stock ticker symbol to stay informed about market updates and company developments."
      }
    ]
  },
  {
    "set_id": 77,
    "size": 2,
    "tools": [
      {
        "tool_id": "mcp-server-fetch-python::get-raw-text",
        "server_name": "mcp-server-fetch-python",
        "tool_name": "get-raw-text",
        "description": "Extract raw text directly from URLs to access content in formats like JSON, XML, CSV, or plain text without browser rendering. Ideal for retrieving source data quickly and efficiently."
      },
      {
        "tool_id": "MCP Server Template for Cursor IDE::mcp_fetch",
        "server_name": "MCP Server Template for Cursor IDE",
        "tool_name": "mcp_fetch",
        "description": "Retrieve website content by inputting a URL, enabling users to fetch and analyze web data directly within Cursor IDE using the MCP Server Template."
      }
    ]
  },
  {
    "set_id": 78,
    "size": 2,
    "tools": [
      {
        "tool_id": "language-server-mcp MCP Server::get_diagnostics",
        "server_name": "language-server-mcp MCP Server",
        "tool_name": "get_diagnostics",
        "description": "Analyze code files to retrieve detailed diagnostic information, including errors and warnings, based on file content, path, language, and project root. Enhances code quality and debugging efficiency."
      },
      {
        "tool_id": "Package Documentation MCP Server::get_diagnostics",
        "server_name": "Package Documentation MCP Server",
        "tool_name": "get_diagnostics",
        "description": "Retrieve diagnostic insights for code files using Language Server Protocol by providing file content, path, and language identifier to enhance debugging and development workflows."
      }
    ]
  },
  {
    "set_id": 79,
    "size": 2,
    "tools": [
      {
        "tool_id": "Yahoo Finance MCP Server::get_ticker_info",
        "server_name": "Yahoo Finance MCP Server",
        "tool_name": "get_ticker_info",
        "description": "Retrieve detailed stock information for a specific symbol using the Yahoo Finance API. Fetch accurate and essential financial data for analysis and decision-making."
      },
      {
        "tool_id": "MCP Yeoman Server::get_ticker_info",
        "server_name": "MCP Yeoman Server",
        "tool_name": "get_ticker_info",
        "description": "Retrieve detailed stock information for a specific symbol using the Yahoo Finance API. Integrate financial data into MCP workflows with mcp-yeoman for seamless automation."
      }
    ]
  },
  {
    "set_id": 80,
    "size": 2,
    "tools": [
      {
        "tool_id": "Puppeteer MCP Server::puppeteer_select",
        "server_name": "Puppeteer MCP Server",
        "tool_name": "puppeteer_select",
        "description": "Automate element selection on web pages using CSS selectors and specified values, streamlining interactions with Select tags in browser automation workflows."
      },
      {
        "tool_id": "Visual UI Debug Agent MCP::playwright_select",
        "server_name": "Visual UI Debug Agent MCP",
        "tool_name": "playwright_select",
        "description": "Automatically select a specific option in a dropdown element using a CSS selector and desired value, streamlining UI interactions in the AI Vision Debug MCP Server."
      }
    ]
  },
  {
    "set_id": 81,
    "size": 2,
    "tools": [
      {
        "tool_id": "Hanzo MCP::think",
        "server_name": "Hanzo MCP",
        "tool_name": "think",
        "description": "Log and analyze complex reasoning or brainstorming tasks without modifying repositories. Use to explore solutions, assess fixes, or interpret test results, enhancing decision-making with structured th..."
      },
      {
        "tool_id": "MCP Think Tool Server::think",
        "server_name": "MCP Think Tool Server",
        "tool_name": "think",
        "description": "Utilize this tool to structure reasoning, analyze steps, or verify policies during complex problem-solving tasks. It appends thoughts to a log for improved sequential decision-making and policy adhere..."
      }
    ]
  },
  {
    "set_id": 82,
    "size": 4,
    "tools": [
      {
        "tool_id": "Ethereum RPC MCP Server::eth_sendTransaction",
        "server_name": "Ethereum RPC MCP Server",
        "tool_name": "eth_sendTransaction",
        "description": "Send transactions to the Ethereum network, specifying sender, recipient, gas, and data parameters for executing smart contracts or transferring value."
      },
      {
        "tool_id": "MCP Crypto Wallet EVM::wallet_send_transaction",
        "server_name": "MCP Crypto Wallet EVM",
        "tool_name": "wallet_send_transaction",
        "description": "Initiate and send transactions on Ethereum and EVM-compatible blockchains using wallet credentials or environment variables. Input transaction details like recipient, gas limits, and values for secure..."
      },
      {
        "tool_id": "EVM MCP Server::write_contract",
        "server_name": "EVM MCP Server",
        "tool_name": "write_contract",
        "description": "Initiate state-changing smart contract functions on Ethereum-compatible blockchains. Specify contract details, ABI, function, and arguments, then sign and send transactions securely."
      },
      {
        "tool_id": "MetaMask MCP::send-transaction",
        "server_name": "MetaMask MCP",
        "tool_name": "send-transaction",
        "description": "Send blockchain transactions securely via MetaMask MCP, specifying recipient, value, gas fees, and chain ID for network compatibility."
      }
    ]
  },
  {
    "set_id": 83,
    "size": 2,
    "tools": [
      {
        "tool_id": "Package Documentation MCP Server::get_hover",
        "server_name": "Package Documentation MCP Server",
        "tool_name": "get_hover",
        "description": "Retrieve detailed hover information for a specific position in a document using Language Server Protocol. Supports multiple programming languages and project configurations for accurate code context i..."
      },
      {
        "tool_id": "language-server-mcp MCP Server::get_hover",
        "server_name": "language-server-mcp MCP Server",
        "tool_name": "get_hover",
        "description": "Retrieve detailed hover information for a specific position in a document, including context and definitions, based on file path, content, and project root for accurate language analysis."
      }
    ]
  },
  {
    "set_id": 84,
    "size": 2,
    "tools": [
      {
        "tool_id": "Markdownify MCP Server - UTF-8 Enhanced::audio-to-markdown",
        "server_name": "Markdownify MCP Server - UTF-8 Enhanced",
        "tool_name": "audio-to-markdown",
        "description": "Convert audio files into markdown format, including transcription, using the Markdownify MCP Server's UTF-8 enhanced capabilities for improved multilingual support."
      },
      {
        "tool_id": "Markdownify MCP Server::audio-to-markdown",
        "server_name": "Markdownify MCP Server",
        "tool_name": "audio-to-markdown",
        "description": "Convert audio files into Markdown format with transcription capabilities. Simplify audio content into structured, readable text for easy sharing and editing."
      }
    ]
  },
  {
    "set_id": 85,
    "size": 2,
    "tools": [
      {
        "tool_id": "playwright-server MCP server::playwright_evaluate",
        "server_name": "playwright-server MCP server",
        "tool_name": "playwright_evaluate",
        "description": "Execute custom JavaScript in the browser console for web automation tasks using the Playwright framework. Ideal for dynamic interactions, data extraction, and testing on web pages."
      },
      {
        "tool_id": "Chrome Tools MCP Server::execute_script",
        "server_name": "Chrome Tools MCP Server",
        "tool_name": "execute_script",
        "description": "Execute JavaScript code in a specified Chrome tab using the Chrome Tools MCP Server, enabling remote control and automation of browser interactions."
      }
    ]
  },
  {
    "set_id": 86,
    "size": 3,
    "tools": [
      {
        "tool_id": "MCP Image Recognition Server::describe_image_from_file",
        "server_name": "MCP Image Recognition Server",
        "tool_name": "describe_image_from_file",
        "description": "Generate detailed descriptions of local images by providing their absolute file path. Ideal for local file access, with guidance through optional prompts. Use with volume mapping in Docker environment..."
      },
      {
        "tool_id": "MCP Image Recognition Server::describe_image",
        "server_name": "MCP Image Recognition Server",
        "tool_name": "describe_image",
        "description": "Generate detailed descriptions of images using base64-encoded data. Ideal for uploaded images in chat conversations, providing accurate analysis via advanced vision APIs."
      },
      {
        "tool_id": "MCP Image Recognition Server::describe_image_from_url",
        "server_name": "MCP Image Recognition Server",
        "tool_name": "describe_image_from_url",
        "description": "Generate detailed descriptions of images using a public URL. Ideal for analyzing web images, this tool supports optional prompts to guide descriptions and works with any server deployment method."
      }
    ]
  },
  {
    "set_id": 87,
    "size": 2,
    "tools": [
      {
        "tool_id": "Blockscout MCP Server::get_latest_block",
        "server_name": "Blockscout MCP Server",
        "tool_name": "get_latest_block",
        "description": "Retrieve the latest indexed block number and timestamp to identify the most recent state of the blockchain, ensuring accurate reference for transactions and API calls."
      },
      {
        "tool_id": "MetaMask MCP::get-block-number",
        "server_name": "MetaMask MCP",
        "tool_name": "get-block-number",
        "description": "Retrieve the most recent block number from a specified blockchain using the MetaMask MCP server, enabling secure and direct blockchain interactions without exposing private keys."
      }
    ]
  },
  {
    "set_id": 88,
    "size": 4,
    "tools": [
      {
        "tool_id": "Google MCP Tools::google_gmail_send_email",
        "server_name": "Google MCP Tools",
        "tool_name": "google_gmail_send_email",
        "description": "Send emails directly via Gmail by specifying recipients, subject, and content. Supports CC, BCC, and HTML formatting for efficient and customizable email communication."
      },
      {
        "tool_id": "mcp-email-server::send_email",
        "server_name": "mcp-email-server",
        "tool_name": "send_email",
        "description": "Send emails using a specified account on the MCP Email Server. Define recipients, subject, body, and optional CC/BCC fields for streamlined email communication."
      },
      {
        "tool_id": "MCP Mailtrap Server::send-email",
        "server_name": "MCP Mailtrap Server",
        "tool_name": "send-email",
        "description": "Send transactional emails through the Mailtrap Email Sending platform by specifying recipients, subject, and body text. Supports HTML content, CC, BCC, and optional sender details for streamlined emai..."
      },
      {
        "tool_id": "Google Workspace MCP Server::send_email",
        "server_name": "Google Workspace MCP Server",
        "tool_name": "send_email",
        "description": "Send emails programmatically using the Gmail API. Specify recipients, subject, and content, including HTML. Manage CC and BCC fields for efficient email distribution."
      }
    ]
  },
  {
    "set_id": 89,
    "size": 3,
    "tools": [
      {
        "tool_id": "mcp-knowledge-graph::search_nodes",
        "server_name": "mcp-knowledge-graph",
        "tool_name": "search_nodes",
        "description": "Find nodes in the knowledge graph by querying entity names, types, and observation content for precise data retrieval within the MCP server."
      },
      {
        "tool_id": "Knowledge Graph Memory Server::search_nodes",
        "server_name": "Knowledge Graph Memory Server",
        "tool_name": "search_nodes",
        "description": "Query and locate nodes in a knowledge graph by matching entity names, types, or observation content, enabling precise data retrieval for enhanced knowledge management."
      },
      {
        "tool_id": "cognee MCP server::search",
        "server_name": "cognee MCP server",
        "tool_name": "search",
        "description": "Query knowledge graphs to retrieve specific information, enabling precise data searches for AI applications. Supports multiple search types for tailored results."
      }
    ]
  },
  {
    "set_id": 90,
    "size": 2,
    "tools": [
      {
        "tool_id": "Yahoo Finance MCP Server::get_top_etfs",
        "server_name": "Yahoo Finance MCP Server",
        "tool_name": "get_top_etfs",
        "description": "Retrieve the top ETFs in a specified sector to identify key investment opportunities. Designed for investors analyzing sector-specific market performance and portfolio diversification."
      },
      {
        "tool_id": "MCP Yeoman Server::get_top_etfs",
        "server_name": "MCP Yeoman Server",
        "tool_name": "get_top_etfs",
        "description": "Retrieve top ETFs by sector using the MCP-Yeoman server. Input a specific sector to analyze and fetch the leading ETFs in that category."
      }
    ]
  },
  {
    "set_id": 91,
    "size": 2,
    "tools": [
      {
        "tool_id": "WikiJS MCP Server::search_pages",
        "server_name": "WikiJS MCP Server",
        "tool_name": "search_pages",
        "description": "Search WikiJS knowledge bases for specific pages using a query string, with optional path and locale filters to refine results."
      },
      {
        "tool_id": "MediaWiki MCP Server::search-page",
        "server_name": "MediaWiki MCP Server",
        "tool_name": "search-page",
        "description": "Search wiki page titles and contents by entering specific terms and receive matching results within a defined limit for efficient information retrieval."
      }
    ]
  },
  {
    "set_id": 92,
    "size": 2,
    "tools": [
      {
        "tool_id": "MCP Yeoman Server::get_top_mutual_funds",
        "server_name": "MCP Yeoman Server",
        "tool_name": "get_top_mutual_funds",
        "description": "Identify leading mutual funds within a specified sector using structured inputs. Ideal for investors and analysts seeking sector-specific fund insights."
      },
      {
        "tool_id": "Yahoo Finance MCP Server::get_top_mutual_funds",
        "server_name": "Yahoo Finance MCP Server",
        "tool_name": "get_top_mutual_funds",
        "description": "Retrieve top mutual funds within a specified sector using the Yahoo Finance MCP Server. Ideal for investors seeking sector-specific fund insights."
      }
    ]
  },
  {
    "set_id": 93,
    "size": 2,
    "tools": [
      {
        "tool_id": "Bankless Onchain MCP Server::get_abi",
        "server_name": "Bankless Onchain MCP Server",
        "tool_name": "get_abi",
        "description": "Retrieves the Application Binary Interface (ABI) for a specified smart contract on a given blockchain network, enabling interaction with contract functions and data."
      },
      {
        "tool_id": "Blockscout MCP Server::get_contract_abi",
        "server_name": "Blockscout MCP Server",
        "tool_name": "get_contract_abi",
        "description": "Retrieve the ABI (Application Binary Interface) of a smart contract using its chain ID and address. The ABI enables interpretation of contract data and formatting of function calls for blockchain inte..."
      }
    ]
  },
  {
    "set_id": 94,
    "size": 2,
    "tools": [
      {
        "tool_id": "Outlook Calendar MCP Tool::create_event",
        "server_name": "Outlook Calendar MCP Tool",
        "tool_name": "create_event",
        "description": "Schedule calendar events or meetings in Microsoft Outlook by specifying subject, date, time, attendees, and other optional details. Organize and manage events directly on your local system with privac..."
      },
      {
        "tool_id": "Google Workspace MCP Server::create_event",
        "server_name": "Google Workspace MCP Server",
        "tool_name": "create_event",
        "description": "Schedule a new calendar event with title, start and end times, location, description, and attendee emails using the Google Workspace MCP Server."
      }
    ]
  },
  {
    "set_id": 95,
    "size": 2,
    "tools": [
      {
        "tool_id": "Rootly MCP Server::search_incidents_paginated",
        "server_name": "Rootly MCP Server",
        "tool_name": "search_incidents_paginated",
        "description": "Retrieve incidents with pagination support by querying titles/summaries. Set page size and number for controlled results, ideal for managing large incident datasets efficiently."
      },
      {
        "tool_id": "Rootly MCP Server::get_all_incidents_matching",
        "server_name": "Rootly MCP Server",
        "tool_name": "get_all_incidents_matching",
        "description": "Fetch and filter incidents by title or summary using a search query, with pagination handled automatically. Specify maximum results for efficient incident retrieval."
      }
    ]
  },
  {
    "set_id": 96,
    "size": 2,
    "tools": [
      {
        "tool_id": "Alchemy MCP Server::fetchAddressTransactionHistory",
        "server_name": "Alchemy MCP Server",
        "tool_name": "fetchAddressTransactionHistory",
        "description": "Retrieve and analyze transaction history for specified wallet addresses across multiple blockchain networks. Use pagination to manage large datasets and filter results by network for targeted insights..."
      },
      {
        "tool_id": "Adamik MCP Server::getAccountHistory",
        "server_name": "Adamik MCP Server",
        "tool_name": "getAccountHistory",
        "description": "Retrieve transaction history for a specific account across blockchain networks using chainId and accountId parameters, streamlining account activity tracking and analysis."
      }
    ]
  },
  {
    "set_id": 97,
    "size": 2,
    "tools": [
      {
        "tool_id": "MCP Ethers Wallet::resolveName",
        "server_name": "MCP Ethers Wallet",
        "tool_name": "resolveName",
        "description": "Convert an ENS name to its corresponding Ethereum address using the MCP Ethers Wallet server. Specify the chain ID or custom RPC URL for precise resolution."
      },
      {
        "tool_id": "Blockscout MCP Server::get_address_by_ens_name",
        "server_name": "Blockscout MCP Server",
        "tool_name": "get_address_by_ens_name",
        "description": "Convert ENS domain names (e.g., 'blockscout.eth') to their corresponding Ethereum addresses using this tool on the Blockscout MCP Server, enabling seamless blockchain data access and analysis."
      }
    ]
  },
  {
    "set_id": 98,
    "size": 2,
    "tools": [
      {
        "tool_id": "Outlook Meetings Scheduler MCP Server::update-event",
        "server_name": "Outlook Meetings Scheduler MCP Server",
        "tool_name": "update-event",
        "description": "Modify existing calendar events in Microsoft Outlook by updating details such as subject, body, time, location, and attendees using the event ID."
      },
      {
        "tool_id": "Google Workspace MCP Server::update_event",
        "server_name": "Google Workspace MCP Server",
        "tool_name": "update_event",
        "description": "Modify existing calendar events by updating attendees, description, start/end times, location, or title using the Google Workspace MCP Server tool."
      }
    ]
  }
]