[
  {
    "set_id": 1,
    "size": 2,
    "tools": [
      {
        "tool_id": "Lodestar MCP Server::download-svg-assets",
        "server_name": "Lodestar MCP Server",
        "tool_name": "download-svg-assets",
        "description": "Download specific SVG assets from a Figma file by providing node IDs and save them to a specified local directory for streamlined asset management in development workflows."
      },
      {
        "tool_id": "Lodestar MCP Server::extract-svg-assets",
        "server_name": "Lodestar MCP Server",
        "tool_name": "extract-svg-assets",
        "description": "Extract SVG assets from Figma files by analyzing the design structure and downloading resources using specified file keys and node IDs. Streamlines asset management for web development."
      }
    ],
    "generated_queries": [
      "Download the 'user-profile-icon' and 'settings-menu' SVG nodes from the Figma file with ID 'dX1yZ9kLmNpQrStUvWxYz' and save them to the 'assets/icons' directory",
      "Extract all SVG components from the Figma project using file key 'abc123-def456' and node IDs 'node_789', 'node_101', and 'node_202' into a folder named 'project-svgs'",
      "Retrieve the 'logo' and 'button-outline' SVG assets from the Figma file 'designs/website_v3.fig' using node IDs 'node_456' and 'node_789' and organize them in the 'src/assets/svg' folder for a React project"
    ]
  },
  {
    "set_id": 2,
    "size": 15,
    "tools": [
      {
        "tool_id": "Image Generation MCP Server::generate_image",
        "server_name": "Image Generation MCP Server",
        "tool_name": "generate_image",
        "description": "Create custom images using a text prompt with adjustable parameters like dimensions, model, and output format. Save images as PNG or generate multiple versions with the Together AI API."
      },
      {
        "tool_id": "AWS Nova Canvas::generate_image",
        "server_name": "AWS Nova Canvas",
        "tool_name": "generate_image",
        "description": "Create images from text prompts using AWS Nova Canvas. Save generated visuals to your workspace, ensuring precise customization with prompt details, dimensions, and quality settings."
      },
      {
        "tool_id": "Together AI Image Server::generate_image",
        "server_name": "Together AI Image Server",
        "tool_name": "generate_image",
        "description": "Create images from text prompts using AI, with options to customize the number of images and diffusion steps. Powered by Together AI Image Server for efficient visual content generation."
      },
      {
        "tool_id": "Table of Contents::generate_image",
        "server_name": "Table of Contents",
        "tool_name": "generate_image",
        "description": "Create high-quality raster or vector images from text prompts using customizable styles, dimensions, and models. Ideal for generating digital illustrations, icons, logos, and realistic images with pre..."
      },
      {
        "tool_id": "Amazon Bedrock MCP Server::generate_image",
        "server_name": "Amazon Bedrock MCP Server",
        "tool_name": "generate_image",
        "description": "Create AI-generated images using the Amazon Nova Canvas model. Input text prompts, adjust parameters like size and quality, and receive Base64-encoded images for diverse applications."
      },
      {
        "tool_id": "MCPollinations Multimodal MCP Server::generateImageUrl",
        "server_name": "MCPollinations Multimodal MCP Server",
        "tool_name": "generateImageUrl",
        "description": "Create an image URL from a text prompt using customizable height, width, model, and enhancement options for tailored visual outputs."
      },
      {
        "tool_id": "Gemini Image Generator MCP Server::generate_image_from_text",
        "server_name": "Gemini Image Generator MCP Server",
        "tool_name": "generate_image_from_text",
        "description": "Transform text prompts into high-quality images using Google's Gemini model. Ideal for creating visuals directly from descriptive inputs via the MCP protocol."
      },
      {
        "tool_id": "powerpoint MCP server::generate-and-save-image",
        "server_name": "powerpoint MCP server",
        "tool_name": "generate-and-save-image",
        "description": "Create and save custom images in PNG format using a descriptive prompt. Ideal for enhancing PowerPoint presentations with tailored visuals generated by a FLUX model."
      },
      {
        "tool_id": "LetzAI MCP Setup Guide::letzai_create_image",
        "server_name": "LetzAI MCP Setup Guide",
        "tool_name": "letzai_create_image",
        "description": "Generate custom images using AI by providing a text prompt. Adjust settings like creativity, quality, mode, and dimensions to create photorealistic or artistic visuals."
      },
      {
        "tool_id": "image-gen MCP Server::generate_image",
        "server_name": "image-gen MCP Server",
        "tool_name": "generate_image",
        "description": "Create custom images with Stable Diffusion by providing prompts, adjusting dimensions, and refining details via configurable parameters like batch size, CFG scale, and sampling steps."
      },
      {
        "tool_id": "Image Generator MCP Server::generate-image",
        "server_name": "Image Generator MCP Server",
        "tool_name": "generate-image",
        "description": "Create custom images using Replicate's Stable Diffusion model. Define dimensions, prompts, and settings to generate and save visuals directly to your local filesystem."
      },
      {
        "tool_id": "MCP Asset Generator::generateImage",
        "server_name": "MCP Asset Generator",
        "tool_name": "generateImage",
        "description": "Convert text prompts into high-quality images for game and web development projects by specifying output path, size, and quality using OpenAI’s image generation capabilities."
      },
      {
        "tool_id": "MCP Server Template for Cursor IDE::generate_image",
        "server_name": "MCP Server Template for Cursor IDE",
        "tool_name": "generate_image",
        "description": "Create custom images using DALL-E 3 by providing a text prompt. Adjust image quality, size, and quantity within the MCP Server Template for Cursor IDE."
      },
      {
        "tool_id": "4o-image MCP Server::generateImage",
        "server_name": "4o-image MCP Server",
        "tool_name": "generateImage",
        "description": "Create or edit images using text prompts or base images. Automatically opens results in your browser and provides direct links for easy access."
      },
      {
        "tool_id": "MCPollinations Multimodal MCP Server::generateImage",
        "server_name": "MCPollinations Multimodal MCP Server",
        "tool_name": "generateImage",
        "description": "Create images using AI by providing a text prompt, adjusting dimensions, format, and saving location. Enhance prompts with LLM, choose models, and ensure reproducibility with seed values."
      }
    ],
    "generated_queries": [
      "Create a high-resolution logo for a new coffee brand featuring a stylized coffee cup and leaf motif in vector format",
      "Generate a realistic 4K image of a cyberpunk cityscape at night with neon lights, flying cars, and rain effects",
      "Design a set of 12 vector icons for a fitness app including dumbbells, running shoes, and heart rate monitors in both flat and outlined styles"
    ]
  },
  {
    "set_id": 3,
    "size": 11,
    "tools": [
      {
        "tool_id": "ReviewWebsite.com - MCP Server::convert_to_markdown",
        "server_name": "ReviewWebsite.com - MCP Server",
        "tool_name": "convert_to_markdown",
        "description": "Convert URLs to Markdown format using AI via the ReviewWebsite API. Input the URL, choose an AI model, and optionally set delays or enable debug mode for streamlined content transformation."
      },
      {
        "tool_id": "MCP Webscan Server::fetch-page",
        "server_name": "MCP Webscan Server",
        "tool_name": "fetch-page",
        "description": "Extract web page content and convert it to Markdown format for analysis or storage. Specify a URL and optional selector to fetch precise data efficiently with MCP Webscan Server."
      },
      {
        "tool_id": "ReviewWebsite.com - MCP Server::scrape_url",
        "server_name": "ReviewWebsite.com - MCP Server",
        "tool_name": "scrape_url",
        "description": "Scrape web content from any URL using ReviewWebsite API, enabling data extraction, URL-to-markdown conversion, and web content interaction for AI-powered tasks."
      },
      {
        "tool_id": "ScrapeGraph MCP Server::markdownify",
        "server_name": "ScrapeGraph MCP Server",
        "tool_name": "markdownify",
        "description": "Convert webpage content into clean, formatted markdown using a simple URL input. Ideal for transforming webpages into easy-to-read text format with ScrapeGraph MCP Server."
      },
      {
        "tool_id": "Fetcher MCP::fetch_url",
        "server_name": "Fetcher MCP",
        "tool_name": "fetch_url",
        "description": "Retrieve web page content via URL, extract main content, and convert it to Markdown or HTML. Customize options like media blocking, page timeout, and navigation settings for efficient content fetching..."
      },
      {
        "tool_id": "Fetch MCP Server::fetch",
        "server_name": "Fetch MCP Server",
        "tool_name": "fetch",
        "description": "Retrieve and process web content by fetching URLs, converting HTML to markdown, and optionally extracting specific character ranges for focused information retrieval."
      },
      {
        "tool_id": "pure.md MCP server::unblock-url",
        "server_name": "pure.md MCP server",
        "tool_name": "unblock-url",
        "description": "Access blocked web content by converting URLs into markdown format using the pure.md MCP server, enabling AI clients to retrieve and process information efficiently."
      },
      {
        "tool_id": "Markdownify MCP Server::webpage-to-markdown",
        "server_name": "Markdownify MCP Server",
        "tool_name": "webpage-to-markdown",
        "description": "Convert any webpage into Markdown format using the Markdownify MCP Server. Extract and transform web content for simplified reading, sharing, and further editing in Markdown."
      },
      {
        "tool_id": "Markdown Downloader MCP Server::download_markdown",
        "server_name": "Markdown Downloader MCP Server",
        "tool_name": "download_markdown",
        "description": "Convert webpages to markdown files with r.jina.ai by entering the URL. Optionally specify a subdirectory for organized storage in the Markdown Downloader MCP server."
      },
      {
        "tool_id": "mcp-server-fetch-python::get-markdown",
        "server_name": "mcp-server-fetch-python",
        "tool_name": "get-markdown",
        "description": "Extract web page content into structured Markdown format, preserving tables and lists. Ideal for converting HTML to clean, readable text while maintaining document structure."
      },
      {
        "tool_id": "MCP Access Template::get-webpage-markdown",
        "server_name": "MCP Access Template",
        "tool_name": "get-webpage-markdown",
        "description": "Convert web page content into Markdown format by parsing a provided URL, enabling easy text extraction and structured content processing."
      }
    ],
    "generated_queries": [
      "Convert the product page of 'https://example-e-commerce.com' into a markdown file for local documentation",
      "Extract all product titles and prices from the homepage of 'https://example-e-commerce.com' using a CSS selector for precise data collection",
      "Access and convert the blocked URL 'https://example-blocked-site.com' into markdown format to analyze its content without direct access"
    ]
  },
  {
    "set_id": 4,
    "size": 3,
    "tools": [
      {
        "tool_id": "AIM Guard MCP::aim-text-guard",
        "server_name": "AIM Guard MCP",
        "tool_name": "aim-text-guard",
        "description": "Analyzes text to identify harmful content, ensuring AI agents adhere to security guidelines and interact safely with external services. Part of the AIM-Guard-MCP server."
      },
      {
        "tool_id": "Enkrypt AI MCP Server::add_guardrails_policy",
        "server_name": "Enkrypt AI MCP Server",
        "tool_name": "add_guardrails_policy",
        "description": "Define and enforce custom content moderation rules by adding a guardrails policy. Configure detectors for injection attacks, PII, NSFW content, toxicity, and more to ensure AI-generated outputs align ..."
      },
      {
        "tool_id": "Baidu Cloud AI Content Safety MCP Server::input_analyze",
        "server_name": "Baidu Cloud AI Content Safety MCP Server",
        "tool_name": "input_analyze",
        "description": "Detect and analyze text for safety risks using Baidu Cloud AI Content Safety MCP Server. Identify harmful or unsafe content to ensure secure communication and compliance."
      }
    ],
    "generated_queries": [
      "Scan all customer support chat transcripts for harmful language and flag any instances of hate speech or harassment",
      "Apply a custom guardrails policy to detect and block phishing attempts in user comments and messages",
      "Analyze a batch of user-submitted articles for NSFW content, PII, and toxicity using the Baidu Cloud AI Content Safety MCP Server"
    ]
  },
  {
    "set_id": 5,
    "size": 5,
    "tools": [
      {
        "tool_id": "playwright-server MCP server::playwright_click",
        "server_name": "playwright-server MCP server",
        "tool_name": "playwright_click",
        "description": "Perform automated clicks on web page elements using CSS selectors with Playwright Server MCP, designed for precise interaction in web automation tasks."
      },
      {
        "tool_id": "Chrome Tools MCP Server::click_element",
        "server_name": "Chrome Tools MCP Server",
        "tool_name": "click_element",
        "description": "Use the 'click_element' tool to programmatically click web elements in Chrome tabs by specifying a CSS selector and tab ID, enabling precise browser automation via the Chrome DevTools Protocol."
      },
      {
        "tool_id": "MCP Web Browser Server::browser_click",
        "server_name": "MCP Web Browser Server",
        "tool_name": "browser_click",
        "description": "Automate clicking on web page elements using CSS selectors to simulate user interactions during security testing, aiding in vulnerability detection for web applications."
      },
      {
        "tool_id": "Puppeteer MCP Server::puppeteer_click",
        "server_name": "Puppeteer MCP Server",
        "tool_name": "puppeteer_click",
        "description": "Automate clicking on web page elements using a CSS selector via the Puppeteer MCP Server, enabling precise browser interaction and form submissions."
      },
      {
        "tool_id": "Visual UI Debug Agent MCP::playwright_click",
        "server_name": "Visual UI Debug Agent MCP",
        "tool_name": "playwright_click",
        "description": "Automate UI interactions by clicking specified elements using CSS selectors. Designed for AI-driven vision analysis and testing workflows with the AI Vision Debug MCP Server."
      }
    ],
    "generated_queries": [
      "Automate the login process on a banking website by clicking the submit button after entering credentials into the username and password fields using a CSS selector",
      "Simulate a user clicking the 'Add to Cart' button on an e-commerce product page to verify the cart counter updates correctly during security testing",
      "Programmatically click the 'Load More' button on a social media feed to test infinite scrolling functionality in a web application"
    ]
  }
]